vanilla-emacs.d/Emacs.org
#+TITLE: My Vanilla Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes :results none
#+STARTUP: fold

* README (Intro)
Whenever this file is saved from my emacs, =init.el= and =early-init.el= are automatically generated based on it. Check [[*Automatically tangle this file (Emacs.org)]] for logic that does this.

Even though =init.el= and =early-init.el= are generated, I still keep them in version control (git), because it helps me avoid the situation where I don't have them on disk (maybe I deleted them, or I did fresh checkout) and can't easily start emacs and evaluate this very org file in order to generate them! By keeping them in version control, I have easy access to them, and I can even more easily see the diffs that were done.

Sometimes manual setup is needed for certain parts of this config to work, for example installing external dependencies or setting up API keys -> settings local to the machine. In such case, you will find instructions how to do it spread through this file, and they will be labeled with =manual_setup= org label.

** NOTE: Splitting (use-package) declarations into multiple org code blocks
This can be useful in order to nicely group and document the code. In this case, best way to do this is to use =(with-eval-after-load 'packagename <code that would normally go under :config>)=, for code that would go under =:config=, which is usually what we need, this is better then having multiple =(use-package ...)= declarations for the same package, because those can allegedly mess up with each other then.

* Preamble (must go first)
** Lexical binding
This has to be first line in the file (in this case init.el) for lexical binding to be enabled!

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

** Timestamps
I am actually not sure how useful is this but I found it fun.

#+name: timestamp
#+begin_src emacs-lisp :tangle no :results value none
  (format-time-string "%Y-%m-%d %H:%M:%S %Z")
#+end_src

#+begin_src emacs-lisp :tangle ./early-init.el :noweb yes
  ;; NOTE: This file was generated from Emacs.org on <<timestamp()>>, don't edit it manually.

#+end_src

#+begin_src emacs-lisp :tangle ./init.el :noweb yes
  ;; NOTE: This file was generated from Emacs.org on <<timestamp()>>, don't edit it manually.

#+end_src

* Package management
** Tutorial
*** package.el vs use-package vs elpaca

There are three important "packages" to understand here: package.el, use-package, and elpaca.

- **package.el** is a default package manager (like e.g. cabal for Haskell) that comes with emacs.
- **use-package** is a third-party package that allows for nicer, declarative and performant way to define your package configurations.
  It uses package.el in the background to install packages, but it is not a package manager, instead it is a layer above it that is focused on loading and configuring packages (and not installing, that it delegates to package manager).
- **elpaca** is a third-party package that is a package manager, a direct alternative to package.el, but more powerful / performant. Instead of downloading tarballs from .e.g melpa, it pulls package sources directly from their git repos.

In this config I use elpaca + use-package (package.el is not even loaded).

*** Installing vs loading vs configuring packages

- Installing package means downloading (and building) the package to your machine, so it can be loaded when you want.
  This is what package manager does for you.
- Loading package means importing/requiring it in our emacs config (init.el), so it can be used. It needs to be installed first in order to be loaded (unless it comes with emacs already).
  This is what use-package takes care of.
- Configuring means exactly that: adapting the package to your needs by defining variables, key bindings, hooks, ... .
  use-package also helps with this, giving us structure and reducing boilerplate.

*** Lifecycle of a package

1. Installation typically happens when you start emacs for first time on new machine, or when you update packages or add new package.
2. Loading typically happens each time you start emacs, and it can happen immediately on init, or it can happen later, on demand,
   when package is needed (in lazy fashion), depending on how you set it up for that package.
3. Configuration typically happens right after loading.

*** use-package

The idea is that you organize all your code in `(use-package <package-name> ...)` declarations.
There is even `(use-package emacs ...)` where `emacs` is a special "package" that won't trigger any installation or loading, allowing you to put general emacs config under it (e.g. `(column-number-mode)`).

use-package has a bunch of keywords that you can use to configure your package or define how it is loaded / installed.
Mostly you will use keywords that come with use-package, but other packages can also extend use-package with their own keywords.
I will quickly explain some of the more important/confusing ones:
- :ensure -> This is really an interface toward package manager (who does package installation). Any value passed to :ensure is passed to the package manager as instructions for installation, e.g. `:ensure (:host "github" :repo "user/repo")`.
    Therefore, its behaviour depends on the package manager used. But generally, `:ensure nil` will not allow package installation, while `:ensure t` or any other value will try to do install package if not installed yet. Should be really named :ensure-installed hah.
    Normally you will want `:ensure t` for most of the packages, in which case you can (I do) configure use-package to have it be `t` by default.
    When using elpaca, you can pass elpaca recipe to :ensure.
- :defer -> `:defer t` tells use-package to postpone loading of the package till it is needed (lazy). See "deferred loading" below.
    Alternatively, you can pass it a number of seconds emacs needs to be idle before package is loaded.
- :demand -> Opposite of defer, `:demand t` tells use-package to load package now. Useful when using autoload keywords (see "deferred loading" below).
- :init -> happens right before package is loaded.
- :config -> happens right after package is loaded.
- ...

**** Deferred loading 

It is generally recommended to postpone/defer loading of packages till they are needed (if applicable), for faster emacs startup.

use-package will defer loading of packages if `:defer <non-nil>` is set, or if any of the keywords with the "autoloading side effect" are used (e.g. `bind`, `command`, `hook`, ... : these all will make use-package defer loading and then autoload package once corresponding binding / command / hook / ... has happeend).

If you use any of the "autoload" keywords but don't want use-package to be "smart" and assume you want autoloading, you can use `:demand t`.

It can be good practice to add `:defer t` even when autoloading keywords are used, to be explicit about the intention.

*** elpaca
Elpaca can install package directly: `(elpaca some-package (message "this happens after package is installed"))`, but we use it via use-package.
In the background, a call to `(use-package some-package :ensure t :some-keyword <smth>)` becomes `(elpaca some-package (use-package some-package :some-keyword <smth>))`.

Compared to native package.el, that pulls in tarballs from package repos, Elpaca (and also Straight) work in a different way -> they pull package sources directly from their github repos, based on the "recipes", which say for each package where to pull from (and optionally how to build them).

**** Recipes

Elpaca allows you to define how the package should be installed via a `recipe`, which is provided as an argument to `:ensure` if using `use-package`.
Example of a recipe: `(some-package :host github :repo "user/example")`.

**** Deferred installing

Elpaca, unlike package.el, doesn't install packages immediately, instead it waits for emacs init to finish, and then installs them asynchronously, in parallel for fast, non-blocking installations.

To prevent this behaviour and make elpaca install package right now, when the corresponding `use-package` declaration is evaluated, one can pass `:wait t` keyword do the elpaca recipe: `:ensure (:wait t ...)`.
This can be useful for packages that e.g. add keywords to use-package, since you need those installed and loaded first.

Due to elpaca's deffered installing, instead of installing and loading happening during init phase (evaluation of init.el), we have following order of events: init -> installation of packages -> loading packages.
Exception are packages with `:wait t` in their recipe, those will get installed / loaded at init.
That also means that `after-init-hook` is often not the right choice any more, and we should instead use `elpaca-after-init-hook`, which will guarantee packages are installed / loaded.

** Config
*** Disable package.el (in early-init.el)

#+begin_src emacs-lisp :tangle ./early-init.el

  (setq package-enable-at-startup nil) ; Elpaca requires this.

#+end_src

*** Install and set up Elpaca (in init.el)

#+begin_src emacs-lisp

  (defvar elpaca-installer-version 0.10)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
        (build (expand-file-name "elpaca/" elpaca-builds-directory))
        (order (cdr elpaca-order))
        (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

#+end_src

*** Set up elpaca lock file

Here we set the elpaca lock file, so that, when installing packages, Elpaca will inherit recipes from =elpaca-lock-file=, where recipes contain exact version control references. Meaning that exact versions of packages as in the lock file are installed each time, ensuring consistency.

#+begin_src emacs-lisp

  (setq elpaca-lock-file (expand-file-name "elpaca-lock.eld" user-emacs-directory))

  (defun my/elpaca-write-lock-file ()
    (interactive)
    (elpaca-write-lock-file elpaca-lock-file)
  )

#+end_src

**** TODO Make updating of lock file automatic (advice on relevant elpaca functions?)
*** Install and set up use-package (with Elpaca as backend)

#+begin_src emacs-lisp

  (elpaca elpaca-use-package (elpaca-use-package-mode)) ; Install/setup use-package.
  (setq use-package-always-ensure t) ; Tells use-package to have :ensure t by default for every package it manages.

#+end_src

