vanilla-emacs.d/init.el

(require 'cl-lib) ;; Common utilities and functions, e.g. cl-some, cl-loop, ... .

;; Package for displaying content in a nice inline overlay.
;; I use it in the rest of the config in some place(s).
(use-package quick-peek)

(defun my/var-state (var)
  "Returns the value of a variable with specified name, or 'my/var-unbound if it is not bound."
  (if (boundp var) (symbol-value var) 'my/var-unbound)
)

(defun my/local-var-state (var)
  "Returns the value of a buffer-local variable with specified name, or 'my/var-unbound if it is not bound."
  (if (local-variable-p var) (symbol-value var) 'my/var-unbound)
)

(defun set-local (var value)
  "Like setq-local but takes a var symbol (analogous to setq and set)."
  (set (make-local-variable var) value)
)

(defun my/save-local-var-state (var)
  "Save the current state of buffer-local VAR (symbol) and return a lambda that restores VAR to its original state.
USAGE:
  (let ((restore-foo (my/save-local-var-state 'foo)))
    ...
    (funcall restore-foo)
  )"
  (let ((og-state (my/local-var-state var)))
    (lambda ()
      (if (eq og-state 'my/var-unbound)
	(kill-local-variable var)
      (set-local var og-state)
    )
    )
  )
)

(defun my/save-local-vars-state (vars)
  "Like my/save-local-var-state but takes a list of vars.
USAGE:
  (let ((restore-vars (my/save-local-vars-state '(foo bar buzz))))
    ...
    (funcall restore-vars)
  )"
  (let ((restore-fns (mapcar #'my/save-local-var-state vars)))
    (lambda () (dolist (restore-fn restore-fns) (funcall restore-fn)))
  )
)

(defun my/set-local-vars-with-restore (vars-and-values)
  "Set each variable in VARS-AND-VALUES as a buffer-local variable with the specified value.
Returns a lambda that, when called, restores each variable to its original buffer-local state.
VARS-AND-VALUES should be a list of (VAR . VALUE) pairs.
USAGE:
  (let ((restore-vars (my/save-local-vars-with-restore '((foo . 42) (bar .  t)))))
    ...
    (funcall restore-vars)
  )"
  (let* ((vars (mapcar #'car vars-and-values))
	 (restore-fn (my/save-local-vars-state vars)))
    (dolist (var-and-value vars-and-values)
      (let ((var (car var-and-value))
	    (value (cdr var-and-value)))
	(set-local var value)
      )
    )
    restore-fn
  )
)

(defun my/save-mode-state (mode)
  "Save the current state (enabled or disabled) of MODE (symbol) and return a lambda that restores MODE to its original state.
USAGE:
  (let ((restore-evil-local-mode (my/save-mode-state 'evil-local-mode)))
    ...
    (funcall restore-evil-local-mode)
  )"
  (let ((og-mode-var-state (my/var-state mode)))
    (lambda ()
      (when (not (eq og-mode-var-state 'my/var-unbound))
        (funcall mode (if (eq og-mode-var-state nil) -1 1))
      )
    )
  )
)

(defun my/save-modes-state (modes)
  "Like my/save-mode-state but takes a list of modes.
USAGE:
  (let ((restore-modes (my/save-modes-state '(evil-local-mode org-tidy-mode))))
    ...
    (funcall restore-modes)
  )"
  (let ((restore-fns (mapcar #'my/save-mode-state modes)))
    (lambda () (dolist (restore-fn restore-fns) (funcall restore-fn)))
  )
)

(defun my/set-modes-with-restore (modes-and-values)
  "Set each mode in MODES-AND-VALUES with the specified value.
Returns a lambda that, when called, restores each mode to its original state (enabled/disabled).
MODES-AND-VALUES should be a list of (MODE . VALUE) pairs.
USAGE:
  (let ((restore-modes (my/save-modes-with-restore '((evil-local-mode . -1) (org-tidy-mode . 1)))))
    ...
    (funcall restore-modes)
  )"
  (let* ((modes (mapcar #'car modes-and-values))
	 (restore-fn (my/save-modes-state modes)))
    (dolist (mode-and-value modes-and-values)
      (let ((mode (car mode-and-value))
	    (value (cdr mode-and-value)))
	(funcall mode value)
      )
    )
    restore-fn
  )
)

(defun random-atom (xs)
  "Returns a random atom from the given list."
  (nth (random (length xs)) xs)
)

(defvar my-motivational-quotes
  '("\"You have power over your mind – not outside events. Realize this, and you will find strength.\" – Marcus Aurelius"
    "\"First say to yourself what you would be; and then do what you have to do.\" – Epictetus"
    "\"Waste no more time arguing about what a good man should be. Be one.\" - Marcus Aurelius"
    "\"No man is free who is not master of himself.\" – Epictetus"
    "\"Well-being is attained by little and little, and nevertheless is no little thing itself.\" – Zeno of Citium"
    "\"Don’t explain your philosophy. Embody it.\" - Epictetus"
    "\"No great thing is created suddenly.\" – Epictetus"
    "\"Begin at once to live, and count each separate day as a separate life.\" – Seneca"
    "\"Dwell on the beauty of life. Watch the stars, and see yourself running with them.\" – Marcus Aurelius"
    "\"Nulla dies sine linea.\" - Pliny the Elder"
    )
)

(use-package emacs
  :ensure nil
  :config
