vanilla-emacs.d/Emacs.org
** General

#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :config
    (setq inhibit-startup-message t)
    (defun display-startup-echo-area-message () (message nil))
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (menu-bar-mode -1)
    (setq ring-bell-function 'ignore)
    (set-fringe-mode 10)
    (setq-default fill-column 100)
    (column-number-mode) ; Show row:column in mode line.
    (visual-line-mode 1) ; Treat wrapped lines as multiple lines when moving around.
    (global-hl-line-mode 1) ; Highlights the line in which cursor is.
    (global-auto-revert-mode t) ; Automatically reload files if they change on disk (will ask if conflict).
    (add-hook 'window-setup-hook 'toggle-frame-fullscreen t) ; Start in fullscreen.
    (setq-default indent-tabs-mode nil) ; Don't use tabs when indenting.
    (delete-selection-mode t) ; Delete the selection with a keypress.

    ;; Sets default font (at size 10). I use Monaspace font (Neon variant) which was created by
    ;; "Github Next" -> Github's dev tools research team. I specifically installed otf "frozen"
    ;; version that comes with all the goodies baked in (check below under Manual Setup).
    ;; Some other nice fonts: "RobotoMono Nerd Font" (best right after Monaspace),
    ;; "Source Code Pro", "Noto Sans Mono".
    ;; NOTE: Monaspace has very cool "texture healing" feature where some letters are widened or narrowed
    ;;   when there is space due to the neighbouring letters, but Emacs doesn't (yet, there is a todo))
    ;;   support OTF's "contextual alternate" feature that is needed for this.
    ;;   If it does support it one day, I should enable it to reap all the benefits of Monaspace font.
    (set-face-attribute 'default nil :family "Monaspace Neon" :height 100)

    (setq gc-cons-threshold 100000000) ; Default is low, so we set it to 100mb. Helps with e.g. lsp-mode.
    (setq read-process-output-max (* 1024 1024)) ;; Default is low, so we set it to 1mb. Helps with e.g. lsp-mode.

    (setq initial-major-mode 'org-mode) ; Start Scratch buffer with Org mode.
    (setq initial-scratch-message (concat "# " (random-atom my-motivational-quotes) "\n\n"))

    (global-subword-mode) ; Makes vim motions treat subwords in camelCase as individual words.

    ;; Emacs by default creates different kinds of additional files on the disk while editing.
    ;; While they can be useful in theory, I found that I don't have much need for any of them,
    ;; while on the other hand they litter the disk and are a potential security issue if they contain
    ;; sensitive information copied from the files that were being edited.
    (setq make-backup-files nil) ; I either have files version controlled or I will manually create backup.
    (setq auto-save-default nil) ; I save so often myself that I don't have a need for this.
    (setq create-lockfiles nil) ; I don't have a situation where multiple emacses want to edit the same file.

    (setq custom-file "/dev/null") ; Prevent emacs from adding `customize` system choices to my init.el.
  )

#+end_src

*** Install the fonts                                        :manual_setup:
For Emacs to be able to use any font, it needs to be installed on your machine.
To install on Archlinux:
 - Monaspace: ~sudo pacman -S otf-monaspace~ -> This "otf" version comes with all the goodies (ligatures, ...) baked in (a "frozen" variant).

** Pretty startup

#+begin_src emacs-lisp :tangle ./early-init.el

  ;; I had emacs window appearing at the very start, for a short time (~0.5-1s), as a small window with white background,
  ;; before the config from init.el (or even early-init.el) is applied.
  ;; Usual advice of setting the `(background . "black")` in early-init.el didn't help, that would happen after it.
  ;; From what I got, the problem is that window is white because Emacs doesn't have control yet, GTK does, and
  ;; by default it shows white window.
  ;; I solved that at the end by setting `(visibility . nil)`, and then when emacs progresses enough, by explicitly
  ;; calling `make-frame-visible` (otherwise it would remain invisible forever).
  ;; This hides the window until init.el is loaded, which means now wait time is longer before first render, ~2s,
  ;; but there is no flashing and sudden changes.
  (setq initial-frame-alist '(
    (visibility . nil)
    (undecorated . t)
    (menu-bar-lines . 0)
    (tool-bar-lines . 0)
    (fullscreen . maximized)
  ))
  (add-hook 'emacs-startup-hook (lambda () (make-frame-visible (selected-frame))))

#+end_src

** GPG

#+begin_src emacs-lisp

  (use-package epg-config
    :ensure nil ; emacs built-in
    :config
    ; Makes emacs query the passphrase via minibuffer, instead of external program.
    (setq epg-pinentry-mode 'loopback)
  )

#+end_src

** plstore

=plstore= is a library for storing elisp plists on disk, in a file. It also encrypts them.
Some emacs packages use it.

#+begin_src emacs-lisp

    (use-package plstore
      :ensure nil ; emacs built-in
      :config
      ; Stops plstore from asking for passphrase many times, instead it caches it and reuses it.
      ; NOTE: If this stops working, alternative is to set it to use GPG key for encryption.
      ;       Check plstore code for instructions on this if it will ever be needed.
      (setq-default plstore-cache-passphrase-for-symmetric-encryption t)
    )

#+end_src

* Theme

#+begin_src emacs-lisp

  ;; doom-themes have nice, high quality themes.
  (use-package doom-themes
    :ensure (:wait t) ; Too ensure theme gets loaded as early as possible, so there is no white scren.
    :config
    ;; I went with moonlight for now. palenight is also nice. city-lights is also not bad. Also tomorrow-night.
    ;; TODO: Figure out where and how is the best way to do theme customization. I am guessing it shoudl be happening in a central place,
    ;;   even if it is about other packages faces, and that it should happen next to loading of the theme?
    (load-theme 'doom-moonlight t)
  )

  ;; Nice themes by Prot.
  ;; `ef-dream' is nice, also `ef-night'.
  (use-package ef-themes
    :ensure (:wait t) ; Too ensure theme gets loaded as early as possible, so there is no white scren.
  )

#+end_src

* Modeline

#+begin_src emacs-lisp

  ;; TODO: Configure better or use some other modeline.
  (use-package doom-modeline
    :custom
    (doom-modeline-height 40)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-minor-modes nil)
    :config
    (doom-modeline-mode 1)
  )

#+end_src

* Undo
** Increase undo memory limits

#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :config
    ;; Default emacs undo limits are quite low so we increase them here.
    (setq undo-limit         50000000) ; ~50mb.
    (setq undo-strong-limit 100000000) ; ~100mb.
    (setq undo-outer-limit  300000000) ; ~300mb.
  )

#+end_src

** undo-fu: "normal" undo behaviour

**undo-fu** is a simple package that brings undo/redo commands that behave in a simple, linear fashion, like you would expect.
However, it still keeps emacs' undo/redo complex system intact with all the state it keeps, these commands just serve as a simpler interface toward it, so you can still interact with it if you wish (e.g. with vundo which visualizes the undo state as tree).
I don't set any keybindings here because it is enough to set undo-fu as evil's undo system (check my evil config) and then evil uses it.

#+begin_src emacs-lisp

  (use-package undo-fu
    :config
    (setq undo-fu-ignore-keyboard-quit t) ; I don't want C-g to trigger normal emacs undo behavior.
  )

#+end_src

** vundo: undo tree

#+begin_src emacs-lisp

  ;; Displays undo history as a tree and lets you move through it.
  (use-package vundo
    :defer t
    :config
    (setq vundo-glyph-alist vundo-unicode-symbols)

    ;;;;;; Vundo Live Diff ;;;;;;
    ;; In vundo, you have to manually mark one node and call diff on another node to get their diff.
    ;; Here we extend vundo to have "live diff mode", that always shows diff between current node and its parent.
    ;; I turn it on by default. It can be toggled by pressing "F".
    (defun vundo-live-diff-post-command ()
      "Post command hook function for live diffing."
      (when (not (memq this-command '(vundo-quit vundo-confirm)))
        (progn
          (vundo-diff-mark (vundo-m-parent (vundo--current-node vundo--prev-mod-list)))
          (vundo-diff)
        )
      )
    )
    (define-minor-mode vundo-live-diff-mode
      "Shows live diff between the current node and its parent."
      :lighter nil
      (if vundo-live-diff-mode
        (add-hook 'post-command-hook #'vundo-live-diff-post-command 0 t)
        (remove-hook 'post-command-hook #'vundo-live-diff-post-command t)
      )
    )
    (evil-define-key 'normal vundo-mode-map (kbd "F") #'vundo-live-diff-mode)
    (add-hook 'vundo-mode-hook (lambda () (vundo-live-diff-mode 1)))
    ;;;;;/ Vundo Live Diff ;;;;;;
  )

#+end_src

** TODO Install undo-fu-session?
Do I need persistent undo between the emacs sessions? I think not?
** TODO Install undo-hl (highlights changes by undo in buffer)?
Seems to not be on any package manager though, so I need straight.el probably.

* Keybindings
