vanilla-emacs.d/Emacs.org
** general.el

#+begin_src emacs-lisp

  ;; general.el provides convenient, unified interface for key definitions.
  ;; It can do many cool things, one of them is specifying leader key and prefixes.
  ;; For best results, you should do all/most of the key defining via general (e.g. `general-define-key`).
  ;; NOTE: I found general.el to be really complex, and I haven't invested the time to properly understand it.
  ;;   Therefore, I don't completely understand if the config below is written in the best way, but
  ;;   it was recommended by others and it seems to work.
  (use-package general
    :ensure (:wait t) ; Load it immediately, so that I can use :general keyword in use-package declarations below if I want.
    :config
    (general-evil-setup t)

    ;; Here we use the following two expressions to create a function ~my/leader-keys~ that we can then use to created
    ;; new keys that all start with SPC prefix (leader key).
    (general-define-key
      :prefix-map 'my/leader-map
      :states '(motion normal insert visual emacs)
      :keymaps 'override ; Override any other keymaps with same keybindings. Otherwise I get issues with the `motion` and SPC, since `motion` already defines keybindings for SPC.
      :prefix "SPC" ; This will be active only in "normal"-like states (so `normal`, `motion` and `emacs`).
      :global-prefix "C-SPC" ; This will be always active.
    )
    (general-create-definer my/leader-keys
      :keymaps 'my/leader-map)

    ;; TODO: Also, should I use :general keyword in use-package? Figure this out, the best way to define keybindings with SPC prefix,
    ;;   should they all be here, or in their respective packages, or what.
    (my/leader-keys
      "SPC" '("M-x (exec cmd)" . counsel-M-x)
      "TAB" '("previous buffer" . my/alternate-buffer)
      "RET" '("work diary" . (lambda () (interactive) (org-agenda nil "d")))

      "^"   '("top-level keybindings" . which-key-show-top-level)

      "C-u" '("universal argument" . universal-argument)

      "0"   '("jump to window 0" . winum-select-window-0)
      "1"   '("jump to window 1" . winum-select-window-1)
      "2"   '("jump to window 2" . winum-select-window-2)
      "3"   '("jump to window 3" . winum-select-window-3)
      "4"   '("jump to window 4" . winum-select-window-4)

      ;; TODO: When inside counsel-projectile-rg, you can do C-c C-o to persist the search results in a special buffer,
      ;;   and then in that buffer you can press enter on any of them and jump to that location.
      ;;   This is awesome, but how will I remember this? Somehow help myself remember this. Another candidate for "hint"/"help" zone?
      ;;   Btw Helm (in Spacemacs) has this bar at the bottom where it shows which command was just run and some hints (C-z for actions, ...).
      ;;   Is this something I can replicate, at least for Ivy?
      "/"   '("search in project" . counsel-projectile-rg)
      "*"   '("search in project w/input" . counsel-projectile-rg-region-or-symbol)

      "`"   '("mark ring" . counsel-mark-ring)

      "t"   '("toggles" . (keymap)) ; This is how prefix is defined.
      "tt"  '("choose theme" . counsel-load-theme)
      "ts"  '("scale text" . hydra-text-scale/body)

      "a"   '("apps" . (keymap))
      "au"  '("undo tree" . vundo)

      "af"  '("fun" . (keymap))
      "afa" 'animate-birthday-present
      "afb" 'blackbox
      "afc" 'butterfly
      "afd" 'doctor
      "afe" 'bubbles
      "aff" 'dunnet
      "afg" 'gnugo
      "afh" 'hanoi
      "afi" 'gomoku
      "afj" 'solitaire
      "afl" 'life
      "afp" 'pong
      "afs" 'snake
      "aft" 'tetris
      "afx" '5x5
      "afz" 'zone

      "q"   '("quit" . (keymap))
      "qq"  '("quit" . save-buffers-kill-terminal)
      "qr"  '("restart" . restart-emacs)

      "w"   '("windows" . (keymap))
      "ww"  '("other window" . ace-window)
      "wd"  '("delete window" . delete-window)
      "wx"  '("delete window and buffer" . kill-buffer-and-window)
      "w/"  '("split vertically" . split-window-right)
      "w-"  '("split horizontally" . split-window-below)
      "wr"  '("resize window" . hydra-window-resize/body)
      "wR"  '("reset: just scratch" . (lambda () (interactive) (delete-other-windows) (scratch-buffer)))
      "wm"  '("move window" . hydra-window-move/body)
      "w."  '("focus window" . delete-other-windows)
      "w="  '("balance window sizes" . balance-windows)

      "b"   '("buffers" . (keymap))
      "bb"  '("switch buffer" . ivy-switch-buffer)
      "bd"  '("kill buffer" . kill-current-buffer)
      "bs"  '("go to scratch" . scratch-buffer)
      "bm"  '("go to messages" . my/switch-to-messages-buffer)
      "bp"  '("previous buffer" . hydra-buffer-next-prev/previous-buffer)
      "bn"  '("next buffer" . hydra-buffer-next-prev/next-buffer)
      "br"  '("reload buffer" . revert-buffer)
      "bv"  '("select whole buffer" . mark-whole-buffer)

      "e"   '("errors" . (keymap))

      "f"   '("files" . (keymap))
      "fj"  '("jump in file" . avy-goto-char-timer)
      "ff"  '("find file" . counsel-find-file)
      "fs"  '("save" . save-buffer)
      "fr"  '("recent files" . counsel-recentf)

      "fe"  '("emacs" . (keymap))
      "feo" '("open Emacs.org file" . my/open-emacs-org-file)
      "fei" '("open init.el file" . my/open-init-file)

      "i"   '("ai" . (keymap))

      "v"   '("eval (elisp)" . (keymap))
      "vl"  '("last-sexp" . eval-last-sexp)
      "vv"  '("top-level form" . eval-defun)
      "vr"  '("region" . eval-region)
      "v:"  '("expression" . eval-expression)

      "o"   '("org" . (keymap))
      "oa"  '("agenda" . org-agenda)
      "oc"  '("capture" . org-capture)
      "ol"  '("store link" . org-store-link)

      "p"   '("projects" . (keymap))
      "pf"  '("find file" . counsel-projectile-find-file)
      "pd"  '("find dir" . projectile-find-dir)
      "pb"  '("switch buffer" . projectile-switch-to-buffer)
      "pp"  '("switch project" . counsel-projectile-switch-project)
      "pr"  '("find and replace" . projectile-replace)
      "p."  '("all commands" . projectile-command-map)
    )

    (general-define-key
      :states '(normal visual)
      :keymaps 'override
      "p" 'my/paste-after-then-hydra
      "P" 'my/paste-before-then-hydra
    )
  )

#+end_src

** which-key

#+begin_src emacs-lisp

  (use-package which-key
    :config
    (setq which-key-idle-delay 0.5)
    (setq which-key-add-column-padding 2)
    (setq which-key-min-display-lines 5)
    (which-key-mode)
  )

#+end_src

