vanilla-emacs.d/init.el

(use-package hydra
  :config
  (defhydra hydra-text-scale ()
    "Scale text"
    ("j" text-scale-decrease "out")
    ("k" text-scale-increase "in")
    ("r" (progn (text-scale-increase 0)) "restore")
    ("q" nil "quit" :exit t)
  )

  (defhydra hydra-buffer-next-prev ()
    "Next/previous buffer"
    ("p" previous-buffer "previous")
    ("n" next-buffer "next")
    ("q" nil "quit" :exit t)
  )

  (defhydra hydra-paste ()
    "Choose what to paste from the kill ring"
    ("C-j" evil-paste-pop "previous")
    ("C-k" evil-paste-pop-next "next")
    ("/" (progn
          (evil-undo-pop) ; Undo last paste.
          ;; NOTE: Ideally, I would put the new paste (about to be selected by counsel-yank-pop)
          ;; starting exactly from the same place as previous paste, as e.g. evil-paste-pop does,
          ;; but I haven't found a simple way to implement that, so I do a more simplistic
          ;; approach, below that is a bit less precise (e.g. adds redundant newline). However I
          ;; don't think that is a big problem if one decided to browse kill ring visually, you
          ;; care less about speed / formatting then.
          (goto-char (nth 2 evil-last-paste)) ; Put cursor back where it was before the last paste.
          (if (eq last-command 'evil-paste-before)
              (evil-insert-newline-above)
              (evil-insert-newline-below)
          )
          (counsel-yank-pop) ; Browse kill ring, pick entry and paste it.
        )
        "browse"
    )
    ("q" nil "quit" :exit t)
  )
  (defun my/paste-after-then-hydra ()
    (interactive)
    (call-interactively 'evil-paste-after)
    (hydra-paste/body)
    ;; This way this command is recognized as evil-paste-after, making evil-paste-after a last-command,
    ;; which is a requirement for evil-paste-pop functions from hydra-paste to be able to be executed
    ;; after this one.
    (setq this-command 'evil-paste-after)
  )
  (defun my/paste-before-then-hydra ()
    (interactive)
    (call-interactively 'evil-paste-before)
    (hydra-paste/body)
    (setq this-command 'evil-paste-before)
  )

  (defhydra hydra-window-resize (:hint nil)
    "
  Resize window
  -------------
              _h_: ⇾ ⇽          ↑        ↓
                            _k_:     _j_:
              _l_: ⇽ ⇾          ↓        ↑
  "
    ("h" shrink-window-horizontally)
    ("j" shrink-window)
    ("k" enlarge-window)
    ("l" enlarge-window-horizontally)
    ("q" nil "quit" :exit t)
  )

  (defhydra hydra-window-move (:hint nil)
    "
  Move window
  -----------
                      _k_: top
              _h_: left       _l_: right
                      _j_: bottom
  "
    ("h" evil-window-move-far-left)
    ("j" evil-window-move-very-bottom)
    ("k" evil-window-move-very-top)
    ("l" evil-window-move-far-right)
    ("q" nil "quit" :exit t)
  )
)

;; CHEATSHEET: C-z puts us into `emacs` mode, which is normal situation without evil.
(use-package evil
  :init
  (setq evil-want-integration t)  ; Required by evil-collection.
  (setq evil-want-keybinding nil) ; Required by evil-collection.
  (setq evil-undo-system 'undo-fu)
  ;; C-u-scroll needs explicit enabling because in Emacs C-u is important, it is
  ;; universal argument. But I don't use it much, so I rather go with vi's
  ;; scroll, which I use a lot. I anyway mapped universal argument to also be SPC C-u.
  (setq evil-want-C-u-scroll t)
  :custom
  (evil-shift-width 2) ; When shifting text left or right with < or >, do it for 2 spaces.
  :config
  (evil-mode 1)
  (define-key evil-motion-state-map (kbd "SPC") nil) ; To avoid conflict with me using SPC as leader key (defined via general.el).
  (define-key evil-motion-state-map (kbd ",") nil) ; I prefer using "," for mode-specific keymap (e.g. for lsp).
)

(use-package evil-escape
  :after evil
  :custom
  (evil-escape-key-sequence "fd")
  :config
  (evil-escape-mode)
)

;; Sets evil keybindings in many more parts of emacs than evil-mode does by default,
;; and in a better way than evil does.
(use-package evil-collection
  :after evil
  :custom (evil-collection-setup-minibuffer nil)  ; If set to `t` it messes up / overrides my custom keybindings for Ivy (e.g. C-k).
  :config (evil-collection-init)
)

(use-package org
  :defer t
  :hook
  (org-mode . (lambda ()
