vanilla-emacs.d/Emacs.org
** Basic setup (org)

#+begin_src emacs-lisp

  (use-package org
    :defer t
    :hook
    (org-mode . (lambda ()
      (org-indent-mode) ; Enforces correct indentation under each heading.
      (visual-line-mode 1)
      (setq evil-auto-indent nil)
    ))
    :config
    (general-define-key
     :states '(normal)
     :keymaps 'org-mode-map
     :prefix ","
     "cs" 'org-schedule
     "cd" 'org-deadline
     "ct" 'org-set-tags-command
     "ce" 'org-set-effort
     "x" 'org-toggle-checkbox
     "J" 'org-priority-down
     "K" 'org-priority-up
     "t" 'org-todo
     "/" 'org-sparse-tree
     "ln" 'org-next-link
     "lp" 'org-previous-link
    )

    ;; Set headers to have different sizes.
    (dolist (face '((org-level-1 . 1.5)
                    (org-level-2 . 1.3)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :height (cdr face))
    )

    (setq org-log-into-drawer t)
    (setq org-habit-graph-column 60)

    (setq org-ellipsis " ▼")
    (set-face-attribute 'org-ellipsis nil
                        :foreground (face-attribute 'shadow :foreground))

    (add-to-list 'org-modules 'org-habit)
    (add-to-list 'org-modules 'org-inlinetask)

    (setq org-priority-faces '((?A . (:foreground "#ff757f" :weight normal))
                               (?B . (:foreground "orange" :weight light))
                               (?C . (:foreground "yellow" :weight light))))

    (set-face-attribute 'org-mode-line-clock nil
                        :inherit 'highlight
                        :weight 'bold)
    (set-face-attribute 'org-mode-line-clock-overrun nil
                        :inherit 'org-mode-line-clock
                        :background (face-attribute 'error :foreground))

    (setq org-todo-keyword-faces
          '(("INBOX" . (:foreground "yellow" :weight bold))
            ("INPR" . (:foreground "dark orange" :weight bold))
            ;; I obtained #446a73 by adding a bit of green to the color of org-agenda-done face.
            ("DONE" . (:foreground "#446a73" :weight bold))
            ;; I got #bf6900 by darkening the "dark orange" which allegedly is #ff8c00.
            ("BLCK" . (:foreground "#bf6900" :weight bold :strike-through t))
            ("CANCELED" . (:foreground "dim gray" :weight bold :strike-through t))
            ("EPIC" . (:foreground "orchid" :weight bold))
            ("CANCELED[EPIC]" . (:foreground "dim gray" :weight bold :strike-through t))
            ("CHKL" . (:foreground "grey" :weight bold))
            ("NOTE" . (:foreground "white" :weight bold))
           )
    )
  )

  ;; Replace header and list bullets (*, **, -, +, ...) with nice bullets.
  (use-package org-superstar
    :after (org)
    :defer t
    :hook (org-mode . org-superstar-mode)
    :custom
    ;; I use `org-superstar-leading-bullets' to hide leading stars of the heading by setting them to space.
    ;; I use two spaces because that is how they have shown it should be done in the docs and it works well.
    ;; Why don't I use `org-superstar-remove-leading-stars', which should hide them for real?
    ;; Because when I tried using it, it resulted in headings being shifted too much to the left.
    (org-superstar-leading-bullet "  ")
    (org-superstar-item-bullet-alist '((?* . ?★) (?+ . ?✦) (?- . ?•)))
    :config
    (set-face-attribute 'org-superstar-item nil :foreground (face-attribute 'font-lock-keyword-face :foreground))
  )

  ;; Org Tempo expands snippets to structures defined in org-structure-template-alist and org-tempo-keywords-alist.
  (use-package org-tempo
    :after (org)
    :ensure nil ; Comes with org already.
  )

  ; Colors tags in org mode with "random" colors based on their string hash.
  (use-package org-rainbow-tags
    :after (org)
    :hook ((org-mode org-agenda-finalize) . org-rainbow-tags-mode)
    :custom
    (org-rainbow-tags-extra-face-attributes '(:slant 'italic :weight 'normal))
    (org-rainbow-tags-adjust-color-percent 100) ; Make colors as light as possible, so they work well with dark bg.
  )

  ;; Display "prettified" pieces of text in their raw shape when point is on them.
  ;; E.g. links or superscript.
  (use-package org-appear
    :hook (org-mode . org-appear-mode)
    :custom
    (org-appear-autoemphasis t)
    (org-appear-autolinks nil) ; `t` is too intrusive, instead I should just use `org-insert-link`.
    (org-appear-autosubmarkers t)
    (org-appear-autoentities t)
    (org-appear-autokeywords t)
    (org-appear-inside-latex t)
    (org-appear-trigger 'always)

    ;; Make bold and italic and similar nice by default, since we now have org-appear
    ;; to show them as raw when needed.
    (org-hide-emphasis-markers t)
  )

#+end_src

** Show org links in echo area

Org and org-agenda mode show links in echo area when you go over them with mouse, but they don't show them if you move to them with cursor.
Therefore, here we replicate that same behaviour when you move over them with cursor.
Since information displayed in echo area upon mouse is ~help-echo~ information, we take that same info and display it when cursor comes at the link.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (defun my/org-display-link-info-at-point ()
      "Display the link info in the echo area when the cursor is on an Org mode link."
      (when-let* ((my/is-face-at-point 'org-link)
                  (link-info (get-text-property (point) 'help-echo)))
        ;; This will show the link in the echo area without it being logged in the Messages buffer.
        (let ((message-log-max nil)) (message "%s" link-info))
      )
    )
    (dolist (h '(org-mode-hook org-agenda-mode-hook))
      (add-hook h (lambda () (add-hook 'post-command-hook #'my/org-display-link-info-at-point nil 'local)))
    )
  )

#+end_src
** evil-org
#+begin_src emacs-lisp

  (use-package evil-org
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
  )

#+end_src

** Code blocks (org-babel)

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; Here we define our custom structure templates (snippets) for quickly creating code blocks.
    ;; Typing e.g. "<elTAB" will expand it to snippet.
    (dolist (key-to-block-type '(("sh" . "src shell")
                                 ("el" . "src emacs-lisp")
  			       ("py" . "src python")))
      (add-to-list 'org-structure-template-alist key-to-block-type)
    )
    
    ;; Define which languages can be evaluated/executed in org files.
    ;; Org will load support for them.
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (python . t))
    )

    (setq org-confirm-babel-evaluate nil) ; Don't ask for confirmation when evaluation a block.
  )

#+end_src

** Automatically tangle this file (Emacs.org)

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (defun my/org-babel-tangle-no-confirm ()
      (let ((org-confirm-babel-evaluate nil)) (org-babel-tangle))
    )
    (defun my/when-emacs-org-file-tangle-on-save ()
      (when (and buffer-file-name (file-equal-p buffer-file-name (my/emacs-org-file-path)))
        (add-hook 'after-save-hook 'my/org-babel-tangle-no-confirm nil 'local)
      )
    )
    (add-hook 'org-mode-hook 'my/when-emacs-org-file-tangle-on-save)
  )

#+end_src

** org-tidy

#+begin_src emacs-lisp

  (use-package org-tidy)

#+end_src

** org-present

Turns any org document into a presentation! Each top-level header is one slide.

#+begin_src emacs-lisp

  (use-package org-present
    :after (org visual-fill-column org-tidy)
    :bind (
      :map org-present-mode-keymap
             ("q" . org-present-quit)
    )
    :config

    ;; TODO: I should make it work with evil-mode.
    ;;   Then I could not probably even need to go read-only.

    (defun my/on-presentation-start ()
      (let ((restore-local-vars
  	      (my/save-local-vars-state
  	        '(visual-fill-column-width
  		  visual-fill-column-center-text
  		  org-tidy-properties-style
  		  org-tidy-general-drawer-flag
  		  org-tidy-general-drawer-name-whitelist)))
            (restore-modes
                (my/save-modes-state
                  '(evil-local-mode
  		  visual-line-fill-column-mode
                    org-tidy-mode)))
  	 )

        (when (featurep 'evil)
          (evil-local-mode -1) ; Otherwise evil messes up org-present.
        )

        (org-present-big)
        (org-display-inline-images)
        (org-present-hide-cursor)
        (org-present-read-only)

        ;; Soft wraps the text at fixed width while also centering it.
        ;; TODO: I could get decent fixed width only with value of 20 when `(org-present-big)`
        ;;   is used above, while I would normally expect 80 to do it.
        ;;   Figure out why is that so -> does usage of `(text-scale-increase)` in `(org-present-big)`
        ;;   uses somehow mess things up? This is because it is after inline-images!
        ;; TODO: There also seems to be some weird interaction between this mode and (org-display-inline-images).
        ;;   If this happens before inlining images, then ATTR_ORG :width behaves weird.
        (setq-local visual-fill-column-width 20
                    visual-fill-column-center-text t)
        (visual-line-fill-column-mode 1)

        ;; Hide org drawers (:PROPERTY: and :NOTES:).
        (setq-local org-tidy-properties-style 'invisible
  		  org-tidy-general-drawer-flag t
  		  org-tidy-general-drawer-name-whitelist '("NOTES"))
        (org-tidy-mode 1)

        (defun my/on-presentation-quit ()
  	(org-present-small)
  	(org-remove-inline-images)
  	(org-present-show-cursor)
  	(org-present-read-write)

  	(funcall restore-local-vars)
  	(funcall restore-modes)

  	(remove-hook 'org-present-mode-quit-hook 'my/on-presentation-quit)
        )
        (add-hook 'org-present-mode-quit-hook 'my/on-presentation-quit)
      )
    )
    (add-hook 'org-present-mode-hook 'my/on-presentation-start)

    (defun my/org-present-eval-print-last-sexp ()
      "Evaluate and print (in buffer) the last sexp while in presentation mode."
      (interactive)
      (org-present-read-write)
      (eval-print-last-sexp)
      (org-present-read-only)
    )
  )

#+end_src

*** Cheatsheet :cheatsheet:
- `org-present` to go into presentation mode.
- left and right arrow take you to previous or next header (which is actually now a slide).
- "q" to exit the presentation.
- I configured it so that it hides :NOTES: org drawer, so you can use it to add speaker notes to each slide.

