vanilla-emacs.d/init.el
    (org-indent-mode) ; Enforces correct indentation under each heading.
    (visual-line-mode 1)
    (setq evil-auto-indent nil)
  ))
  :config
  (general-define-key
   :states '(normal)
   :keymaps 'org-mode-map
   :prefix ","
   "cs" 'org-schedule
   "cd" 'org-deadline
   "ct" 'org-set-tags-command
   "ce" 'org-set-effort
   "cb" 'org-toggle-checkbox

   "J" 'org-priority-down
   "K" 'org-priority-up
   "t" 'org-todo
  )

  ;; Set headers to have different sizes.
  (dolist (face '((org-level-1 . 1.5)
                  (org-level-2 . 1.3)
                  (org-level-3 . 1.2)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :height (cdr face))
  )

  (setq org-log-into-drawer t)
  (setq org-habit-graph-column 60)

  (setq org-ellipsis " ▼")
  (set-face-attribute 'org-ellipsis nil :foreground (face-attribute 'shadow :foreground))

  (add-to-list 'org-modules
	'org-habit
  )

  (setq org-priority-faces '((?A . (:foreground "#ff757f" :weight normal))
                             (?B . (:foreground "orange" :weight light))
                             (?C . (:foreground "yellow" :weight light))))
)

;; Replace header and list bullets (*, **, -, +, ...) with nice bullets.
(use-package org-superstar
  :after (org)
  :defer t
  :hook (org-mode . org-superstar-mode)
  :custom
  ;; I use `org-superstar-leading-bullets' to hide leading stars of the heading by setting them to space.
  ;; I use two spaces because that is how they have shown it should be done in the docs and it works well.
  ;; Why don't I use `org-superstar-remove-leading-stars', which should hide them for real?
  ;; Because when I tried using it, it resulted in headings being shifted too much to the left.
  (org-superstar-leading-bullet "  ")
  (org-superstar-item-bullet-alist '((?* . ?★) (?+ . ?✦) (?- . ?•)))
  :config
  (set-face-attribute 'org-superstar-item nil :foreground (face-attribute 'font-lock-keyword-face :foreground))
)

;; Org Tempo expands snippets to structures defined in org-structure-template-alist and org-tempo-keywords-alist.
(use-package org-tempo
  :after (org)
  :ensure nil ; Comes with org already.
)

; Colors tags in org mode with "random" colors based on their string hash.
(use-package org-rainbow-tags
  :after (org)
  :hook ((org-mode org-agenda-finalize) . org-rainbow-tags-mode)
  :custom
  (org-rainbow-tags-extra-face-attributes '(:slant 'italic :weight 'normal))
  (org-rainbow-tags-adjust-color-percent 100) ; Make colors as light as possible, so they work well with dark bg.
)

;; Display "prettified" pieces of text in their raw shape when point is on them.
;; E.g. links or superscript.
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-autoemphasis t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t)
  (org-appear-trigger 'always)
  ;; Make bold and italic and similar nice, since we now have org-appear
  ;; to show them as raw when needed.
  (org-hide-emphasis-markers t)
)

(use-package evil-org
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
)

(with-eval-after-load 'org
  ;; Here we define our custom structure templates (snippets) for quickly creating code blocks.
  ;; Typing e.g. "<elTAB" will expand it to snippet.
  (dolist (key-to-block-type '(("sh" . "src shell")
                               ("el" . "src emacs-lisp")
			       ("py" . "src python")))
    (add-to-list 'org-structure-template-alist key-to-block-type)
  )
  
  ;; Define which languages can be evaluated/executed in org files.
  ;; Org will load support for them.
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t))
  )

  (setq org-confirm-babel-evaluate nil) ; Don't ask for confirmation when evaluation a block.
)
