vanilla-emacs.d/Emacs.org
*** Evil keybindings

#+begin_src emacs-lisp

  (with-eval-after-load 'evil
    ;; TODO: I am basing these keybindings on the evil-org-agenda-set-keys function from
    ;;   evil-org-agenda.el (from evil-org package), but I copied them directly here so I can easily modify
    ;;   them as I wish.

    (evil-set-initial-state 'org-agenda-mode 'motion)

    (evil-define-key 'motion org-agenda-mode-map
      ;; Opening org file.
      (kbd "<tab>") 'org-agenda-goto
      (kbd "RET") 'org-agenda-switch-to
      (kbd "M-RET") 'org-agenda-recenter

      ;; Motion.
      "j" 'org-agenda-next-line
      "k" 'org-agenda-previous-line
      "gH" 'evil-window-top
      "gM" 'evil-window-middle
      "gL" 'evil-window-bottom
      (kbd "C-j") 'org-agenda-next-item
      (kbd "C-k") 'org-agenda-previous-item
      (kbd "[[") 'org-agenda-earlier
      (kbd "]]") 'org-agenda-later

      ;; manipulation
      ;; We follow standard org-mode bindings (not org-agenda bindings):
      ;; <HJKL> change todo items and priorities.
      ;; M-<jk> drag lines.
      ;; M-<hl> cannot demote/promote, we use it for "do-date".
      "J" 'org-agenda-priority-down
      "K" 'org-agenda-priority-up
      "H" 'org-agenda-do-date-earlier
      "L" 'org-agenda-do-date-later
      "t" 'org-agenda-todo
      (kbd "M-j") 'org-agenda-drag-line-forward
      (kbd "M-k") 'org-agenda-drag-line-backward
      (kbd "C-S-h") 'org-agenda-todo-previousset ; Original binding "C-S-<left>"
      (kbd "C-S-l") 'org-agenda-todo-nextset ; Original binding "C-S-<right>"

      ;; undo
      "u" 'org-agenda-undo

      ;; actions
      "dd" 'org-agenda-kill
      "dA" 'org-agenda-archive
      "da" 'org-agenda-archive-default-with-confirmation
      "ct" 'org-agenda-set-tags
      "ce" 'org-agenda-set-effort
      "cs" 'org-agenda-schedule
      "cd" 'org-agenda-deadline
      "cT" 'org-timer-set-timer
      "i" 'org-agenda-diary-entry
      "a" 'org-agenda-add-note
      "A" 'org-agenda-append-agenda
      "C" 'org-agenda-capture
      "e" 'org-agenda-tree-to-indirect-buffer
      "o" 'org-agenda-goto

      ;; mark
      "m" 'org-agenda-bulk-toggle
      "~" 'org-agenda-bulk-toggle-all
      "%" 'org-agenda-bulk-mark-regexp
      "x" 'org-agenda-bulk-action

      ;; refresh
      "gr" 'org-agenda-redo
      "gR" 'org-agenda-redo-all

      ;; quit
      "ZQ" 'org-agenda-exit
      "ZZ" 'org-agenda-quit

      ;; display
      "gD" 'org-agenda-view-mode-dispatch
      "ZD" 'org-agenda-dim-blocked-tasks

      ;; clock
      "I" 'org-agenda-clock-in ; Original binding
      "O" 'org-agenda-clock-out ; Original binding
      "cg" 'org-agenda-clock-goto
      "cc" 'org-agenda-clock-cancel
      "cr" 'org-agenda-clockreport-mode

      ;; go and show
      "." 'org-agenda-goto-today
      "gc" 'org-agenda-goto-calendar
      "gC" 'org-agenda-convert-date
      "gd" 'org-agenda-goto-date
      "gh" 'org-habit-stats-view-habit-at-point-agenda
      "gm" 'org-agenda-phases-of-moon
      "gs" 'org-agenda-sunrise-sunset
      "gt" 'org-agenda-show-tags
      "ge" 'org-agenda-entry-text-mode

      "p" 'org-agenda-date-prompt
      "P" 'org-agenda-show-the-flagging-note

      "+" 'org-agenda-manipulate-query-add
      "-" 'org-agenda-manipulate-query-subtract
    )
  )

#+end_src

*** org-super-agenda

Org-super-agenda allows both easier and smarter grouping of entries under a day/week org agenda view.
Each org-super-agenda group "consumes" entries it shows, leaving the next group with less entries, kind of like a parser. Whatever is left at the end is shown at the end of agenda as "Other items".

#+begin_src emacs-lisp

  (use-package org-super-agenda
    :after org
    :init
    ;; org-super-agenda-header-map is keymap for super agenda headers and normally it just copies keybindings
    ;; from org-agenda-mode-map, but since I modify those later with evil-org, then I don't want
    ;; org-super-agenda-header-map sticking to the old keybindings and having super agenda headers behave
    ;; in default, non-evil way (e.g. "j" when on them doesn't move down but opens calendar).
    ;; I haven't managed to figure out how to update it to behave in an evil fashion, so I ended up just disabling
    ;; it completely, and that works great.
    (setq org-super-agenda-header-map nil)
    (setq org-super-agenda-keep-order t) ; Can degrade performance, which is why it isn't enabled by default.
    :config
    (org-super-agenda-mode)
  )

#+end_src

*** Work Diary

#+name: my/work-diary-org-path
#+begin_src emacs-lisp :tangle no :results value none
  "~/Dropbox/work-diary.org"
#+end_src

**** Inbox
Inbox here is the same concept as is in GTD: a place where I can quickly drop raw ideas / tasks that are to be refined later (soon).
We drop these in Work Diary org file, with the right todo keyword (INBOX), at the place of special org target in the org file.

I define a bash script that can be used outside of emacs to easily add entries to inbox (should be bound to some easily accessible OS-wide keybinding).
This bash script picks up whatever is in the clipboard, and if it is URI, it will automatically add it to the entry. Therefore, usual workflow is to copy the URI if there is one (e.g. Discord message link) and then call the script via the keybinding.

#+begin_src bash :tangle ./inbox-add.bash :noweb yes

  WORK_DIARY_ORG_PATH="$(eval echo "<<my/work-diary-org-path()>>")"
  # I redundantly escape < and > here to not trigger the noweb interpolation.
  WORK_DIARY_ORG_INBOX_TARGET="\<\<Insert INBOX tasks here\>\>"

  # Obtain URI from the clipboard, if there is one.
  uri=$(wl-paste)
  if [[ ! "$uri" =~ ^[a-zA-Z][a-zA-Z0-9+.-]*:// ]]; then
    uri=""
  fi

  SEPARATOR=";"
  input=$(yad --title="Inbox" --form --separator="${SEPARATOR}" \
              --field="Title" "" \
              --field="Uri" "${uri}" \
              --field="Description" "" \
              --button=Add:0) || exit 1
  title=$(echo "${input}" | cut -d"${SEPARATOR}" -f1)
  uri=$(echo "${input}" | cut -d"${SEPARATOR}" -f2)
  description=$(echo "${input}" | cut -d"${SEPARATOR}" -f3)

  if [ -z "${title}" ]; then exit 1; fi

  org_heading="** INBOX ${title}"
  if [ -n "$uri" ]; then
    org_heading="$org_heading ([[${uri}][URI]])"
  fi
  if [ -n "$description" ]; then
    org_heading="$org_heading"$'\n'"  ${description}"
  fi

  sed -i "/${WORK_DIARY_ORG_INBOX_TARGET}/r /dev/stdin" "${WORK_DIARY_ORG_PATH}" <<< "${org_heading}"

#+end_src

***** System requirements and defining an OS keybinding    :manual_setup:
- For the bash script to work, make sure that ~yad~ and ~wl-clipboard~ are installed system wide.
- Also set up a keybinding at the OS level that will allow to easily run the script. A good one is =Win + I=.

*** Marking todo deadlines with earlier schedule

These are todo deadline entries that are not yet done and have a schedule some earlier day.
You will usually encounter such entries when looking at future dates in the weekly agenda view.
They are indicators of deadlines, but are likely to be done earlier, so by clearly marking them we can adapt things such as calculating expected effort for such days, and also make it clear visually that they are likely not to be done on that day (day of deadline).

#+begin_src emacs-lisp

  (defvar my/after-org-agenda-mark-todo-deadlines-with-earlier-schedule-hook nil
    "Hook called after the marking of the todo deadlines with the earlier schedule")

  (defun my/org-agenda-mark-todo-deadlines-with-earlier-schedule ()
    "Mark all todo deadline entries in agenda that have earlier schedule.
  It will both mark them with a text property and also style them to be less emphasized."
    (save-excursion
      (while (< (point) (point-max))
        (let* ((entry-type (org-get-at-bol 'type))
               (entry-is-deadline (string= entry-type "deadline"))
               ;; org-hd-marker returns position of header in the original org buffer.
               (entry-marker (org-get-at-bol 'org-hd-marker))
               (entry-scheduled-time-str (when entry-marker (org-entry-get entry-marker "SCHEDULED")))
               (entry-deadline-time-str (when entry-marker (org-entry-get entry-marker "DEADLINE")))
               (entry-todo-state (org-get-at-bol 'todo-state))
               (entry-is-done (when entry-todo-state
                               (member entry-todo-state org-done-keywords-for-agenda)))
               (entry-is-todo (when entry-todo-state (not entry-is-done)))
               (entry-scheduled-before-deadline
                (and entry-scheduled-time-str
                      entry-deadline-time-str
                      (< (org-time-string-to-absolute entry-scheduled-time-str)
                        (org-time-string-to-absolute entry-deadline-time-str)
                      )
                )
               )
              )
          (when (and entry-is-deadline entry-is-todo entry-scheduled-before-deadline)
            (let ((ov (make-overlay (line-beginning-position) (line-end-position))))
              (overlay-put ov 'face '(:weight extra-light :slant italic))
              (overlay-put ov 'category 'my-agenda-todo-deadline-with-earlier-schedule)
              (put-text-property (line-beginning-position) (line-end-position) 'is-todo-deadline-with-earlier-schedule t)
            )
          )
        )
        (forward-line)
      )
    )
    (run-hooks 'my/after-org-agenda-mark-todo-deadlines-with-earlier-schedule-hook)
  )

  (add-hook 'org-agenda-finalize-hook 'my/org-agenda-mark-todo-deadlines-with-earlier-schedule)

#+end_src

*** Calculating total daily leftover effort

#+begin_src emacs-lisp

  (require 'cl-lib)

  (defun my/org-agenda-calculate-total-leftover-effort-today (point-limit)
    "Sum the leftover org agenda entries efforts for today from the current point till the POINT-LIMIT.
  Return minutes (number)."
    (let (efforts)
      (save-excursion
        (while (< (point) point-limit)
          (let* ((entry-type (org-get-at-bol 'type))
                 ;; org-hd-marker returns position of header in the original org buffer.
                 (entry-marker (org-get-at-bol 'org-hd-marker))
                 (entry-scheduled-time-str (when entry-marker (org-entry-get entry-marker "SCHEDULED")))
                 (entry-deadline-time-str (when entry-marker (org-entry-get entry-marker "DEADLINE")))
                 (entry-todo-state (org-get-at-bol 'todo-state))
                 (entry-is-done (when entry-todo-state
                                  (member entry-todo-state org-done-keywords-for-agenda)))
                 (entry-is-todo (when entry-todo-state (not entry-is-done)))
                )
            (when (and entry-is-todo
                       ;; We intentionally didn't include the "upcoming deadline" entries.
                       (or (member entry-type '("scheduled" "past-scheduled" "timestamp"))
                           ;; We count only deadlines that also have a scheduled time on that same day.
                           ;; This is specific to how my agenda is set up: Such deadline entries will
                           ;; appear under the list of tasks for today, so we want to count them.
                           (and (string= entry-type "deadline")
                                entry-scheduled-time-str
                                entry-deadline-time-str
                                (= (org-time-string-to-absolute entry-scheduled-time-str)
                                   (org-time-string-to-absolute entry-deadline-time-str)
                                )
                           )
                       )
                  )
              (push (org-entry-get entry-marker "Effort") efforts)
            )
          )
          (forward-line)
        )
      )
      (cl-reduce #'+
                 (mapcar #'org-duration-to-minutes (cl-remove-if-not 'identity efforts))
                 :initial-value 0
      )
    )
  )

  (defun my/org-agenda-insert-total-daily-leftover-efforts ()
    "Insert the total scheduled effort for each day inside the agenda buffer."
    (save-excursion
      (let (curr-date-header-pos)
        (while (setq curr-date-header-pos (text-property-any (point) (point-max) 'org-agenda-date-header t))
          (goto-char curr-date-header-pos)
          (end-of-line)
          (let* ((next-date-header-pos (text-property-any (point) (point-max) 'org-agenda-date-header t))
                 (total-effort (my/org-agenda-calculate-total-leftover-effort-today
                                (or next-date-header-pos (point-max))))
                )
            (insert-and-inherit (concat " (∑⏳ = " (org-duration-from-minutes total-effort) ")"))
          )
          (forward-line)
        )
      )
    )
  )

  (add-hook 'org-agenda-finalize-hook 'my/org-agenda-insert-total-daily-leftover-efforts)

#+end_src

