vanilla-emacs.d/Emacs.org
*** TODO Add manual sorting of agenda entries
If I define ~org-agenda-cmp-user-defined~ then I can in ~org-agenda-sorting-strategy~ say that I use ~user-defined-up~ (or ~down~). I could define it to take a look at some custom ~order~ org property that I will define commands and keybindings to easily change in org agenda and that way I get manual sorting of entries in agenda.
I will probably want to put right after sorting by timestamp or maybe even first.
*** TODO Explore org-ql
It gives a lot of control over what I want to show in agenda. I could use it to build some very custom agenda views, for example all tasks from the sprint, or something like that. Not sure yet but I think it is worth exploring it for creating additional custom agenda commands.
** Capture templates

#+begin_src emacs-lisp :noweb yes

  (let* ((wd-path "<<my/work-diary-org-path()>>")
         (wd-tasks `(file+headline ,wd-path "Tasks"))
        )
    (setq org-capture-templates
          `(("t" "Task" entry ,wd-tasks
             "** TODO %?")
            ("T" "Task (today)" entry ,wd-tasks
             "** TODO %?\nSCHEDULED: %t")
            ("n" "Task (now)" entry ,wd-tasks
             "** TODO %?\nSCHEDULED: %t" :clock-in t :clock-keep t)
            ("i" "Task (inbox)" entry ,wd-tasks
             "** INBOX %?" :prepend t)
            ("j" "Journal" item (file+olp+datetree ,wd-path "Journal")
             "%?" :unnarrowed t)
           )
    )
  )

#+end_src

*** TODO Read more about it [0/1]
- [ ] https://www.reddit.com/r/emacs/comments/7zqc7b/share_your_org_capture_templates/
** Cheatsheet :cheatsheet:
- Shift-Tab -> cycles through expanding headers. Can be used to fold all but the current item -> Shift-Tab to fold all, then Tab to unfold current item.
- structure templates (snippets) -> type "<snippetstringTAB" to expand it to snippet. e.g. "<el". Be faster than completion or reject it first with C-g.
- org-babel is org package (comes with org) that allows execution of code blocks, sharing data between code blocks (polyglot), tangling (exporting code into file / literal programming), ... .
- When in code block, to get full support for that language (proper completion, ...), open it in separate buffer with "C-c '" and do the editing there.
* My buffer/file functions

#+begin_src emacs-lisp

  (use-package emacs
    :ensure nil
    :config
    (defun my/alternate-buffer (&optional window)
      "Switch back and forth between current and last buffer in the current window."
      (interactive)
      (cl-destructuring-bind (buf start pos)
        (or (cl-find (window-buffer window) (window-prev-buffers) :key #'car :test-not #'eq)
            (list (other-buffer) nil nil)
        )
        (if (not buf)
          (message "Last buffer not found.")
          (set-window-buffer-start-and-point window buf start pos)
        )
      )
    )

    (defun my/open-init-file ()
      "Open the init file."
      (interactive)
      (find-file user-init-file)
    )

    (defun my/open-emacs-org-file ()
      "Open the init file."
      (interactive)
      (find-file (my/emacs-org-file-path))
    )

    (defun my/emacs-org-file-path ()
      (expand-file-name (file-name-concat user-emacs-directory "Emacs.org"))
    )

    (defun my/switch-to-messages-buffer ()
      "Switch to the messages buffer."
      (interactive)
      (switch-to-buffer "*Messages*")
    )
  )

#+end_src

* Ivy, Counsel and Swiper
** ivy

#+begin_src emacs-lisp

    ;; Ivy is the main thing (nice search through list of stuff, in minibuffer and elsewhere),
    ;; while Counsel and Swiper extend its usage through more of the Emacs.

    ;; TODO: Check out Ivy hydra -> I saw it in Ivy manual but don't know how to use it (it doesn't seem to be installed?).
    ;;   Allegedly (use-package ivy-hydra :after (ivy hydra)) should do the job? Try it.
    ;; TODO: Should I set Ivy to use fuzzy search? Is that better or not?
    ;; TODO: In Spacemacs (helm), coloring of listed files on C-x C-f is richer than I have in Ivy here.
    ;; Directories have stronger contrast, hidden files are grey, symbolic links neon, ... .
    ;; I should also get Ivy to behave like this! Right now it shows dirs in too similar color uses the same
    ;; color for all the rest.
    ;;   TODO: Show this cheatsheet somehow as part of Ivy buffers? Kind of like Helm does in Spacemacs?
    (use-package ivy
      :bind (
            ;; I define some evil-ish keybindings here since neither evil not evil-connection
            ;; define these specific ones for Ivy.
            :map ivy-minibuffer-map ;; When in the minibuffer.
                  ("C-h" . ivy-backward-kill-word)
                  ("C-j" . ivy-next-line)
                  ("C-k" . ivy-previous-line)
                  ("C-l" . ivy-alt-done)
                  ("TAB" . ivy-alt-done)
            :map ivy-switch-buffer-map ; When in the buffer switching mode.
                  ("C-j" . ivy-next-line)
                  ("C-k" . ivy-previous-line)
                  ("C-l" . ivy-done)
                  ("C-d" . ivy-switch-buffer-kill)
            :map ivy-reverse-i-search-map ; When doing incremental search.
                  ("C-j" . ivy-next-line)
                  ("C-k" . ivy-previous-line)
                  ("C-l" . ivy-done)
                  ("C-d" . ivy-reverse-i-search-kill)
            )
      :custom
      (ivy-height 20)
      (ivy-use-virtual-buffers t)  ; Adds recent files and bookmarks and similar to results.
      (ivy-display-style 'fancy)
      (ivy-count-format "(%d/%d) ")  ; (num listed / total num)
      (ivy-extra-directories nil)  ; Don't show ./ and ../
      :config
      ;; ivy-format-functions-alist determines for each place where ivy is used how the output should be formatted.
      ;; t stands for default case, if there was no more specific formatting function defined.

      ;; Here, we specify which formatting function to use as a default case (t).
      ;; We choose ivy-format-functon-line, that extends the higlight of selection to the edge of the window,
      ;; not just till the end of the selected word. This is one of default choices and it looks better.
      ;; This is recommended by ivy-rich, as a setting.
      (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-arrow-line)

      ;; ivy-re-builders-alist defines which completion styles (fuzzy, in order, ...) to use for which ivy usage.
      ;; Here I define that we use ivy--regex-ignore-order for all situations, instead of the default ivy--regex-plus,
      ;; which is the same but cares about the order of words in the query, which I found to not be useful.
      (setq ivy-re-builders-alist
            '((t . ivy--regex-ignore-order)))

      ;; ivy-initial-inputs-alist defines what to start specific searches with. Default is ^ for all searches,
      ;; which makes queries start from the start of each completion candidate, but I set it to nil to avoid that.
      (setq ivy-initial-inputs-alist nil)

      ;; This will enhance specific emacs commands with ivy automatically.
      (ivy-mode 1)
    )

#+end_src

*** Cheatsheet :cheatsheet:
- M-o when in an Ivy buffer shows extra commands that can be run on selected completion item.

** counsel

#+begin_src emacs-lisp

  ;; Counsel is a package that is part of Ivy ecosystem.
  ;; It brings enhanced versions of common emacs commands, powered by Ivy.
  ;; Ivy already offers some enhanced commands, but Counsel offers more and better.
  (use-package counsel
    :config
    (setq counsel-describe-function-function 'helpful-callable)
    (setq counsel-describe-variable-function 'helpful-variable)
    (counsel-mode 1)  ; This will remap the built-in Emacs functions that have counsel replacements.
  )

#+end_src

** swiper

#+begin_src emacs-lisp

  ;; Swiper is a package that is part of Ivy ecosystem.
  ;; Better isearch (incremental search), powered by Ivy.
  (use-package swiper
    :bind (("C-s" . swiper)
           :map evil-normal-state-map
           ("/" . swiper)
           ("*" . swiper-thing-at-point)
           :map evil-motion-state-map
           ("/" . swiper)
           ("*" . swiper-thing-at-point)
          )
  )

#+end_src

