vanilla-emacs.d/Emacs.org
** ivy-rich

#+begin_src emacs-lisp

  ;; Show more info for some usages of Ivy. Also allows easier customization of Ivy output.
  (use-package ivy-rich
    :after (ivy counsel)
    :config
    ;; This is my custom function for how Ivy shows candidates when finding a file.
    ;; Unlike default function used by ivy(-rich), here I do some additional formatting:
    ;;  - I stylize dot(files/dirs).
    ;;  - I stylize executables.
    (defun my/ivy-read-file-transformer (filename)
      "Transform candidate STR when reading files."
      (let*
        ((current-dir (or (ivy-state-directory ivy-last) default-directory))
        (filepath (expand-file-name filename current-dir))
        (is-dir (ivy--dirname-p filename))
        (is-dotfile (string-prefix-p "." filename))
        (is-exec (file-executable-p filepath))
        )
        (cond
  	((and is-dir is-dotfile) (propertize filename 'face '(:inherit (font-lock-comment-face ivy-subdir))))
  	(is-dotfile (propertize filename 'face 'font-lock-comment-face))
  	(is-dir (propertize filename 'face 'ivy-subdir))
  	(is-exec (propertize filename 'face 'font-lock-keyword-face))
  	(t filename)
        )
      )
    )

    ;; With ivy-rich-set-columns, you can add new ones or replace existing columns when ivy is used in specific commands.
    ;; For details check out ivy-rich docs and docs of ivy-rich-display-transformers-list .
    (ivy-rich-set-columns
      'counsel-find-file  ; Set columns for this command (therefore when finding file).
      '((my/ivy-read-file-transformer)  ; Use my function instead of default ivy-read-file-transformer.
        (ivy-rich-counsel-find-file-truename (:face font-lock-doc-face))  ; This I kept the same. It adds target for links.
       )
    )

    (ivy-rich-mode 1)
  )

#+end_src

* Projectile

#+begin_src emacs-lisp
  
  ;; Projectile brings the concept of "Project" to emacs, as a project on the disk.
  (use-package projectile
    :init
    ;; First thing that happens on switching to a new project.
    ;; TODO: Try without this, see if I like that better or not, or if I would like something else.
    (setq projectile-switch-project-action #'projectile-dired)
    :bind-keymap
    ("C-c p" . projectile-command-map) ; TODO: Get this behind SPC.
    :custom
    ((projectile-completion-system 'ivy))
    :config
    (projectile-mode)
  )

  ;; Provides better integration of Projectile and Counsel.
  (use-package counsel-projectile
    :config
    (defun counsel-projectile-rg-region-or-symbol ()
      "Search for selected region if active, otherwise search for symbol at point using `counsel-projectile-rg`."
      (interactive)
      (let ((counsel-projectile-rg-initial-input (projectile-symbol-or-selection-at-point)))
          (counsel-projectile-rg)
      )
    )

    (counsel-projectile-mode)
  )

#+end_src

** Cheatsheet :cheatsheet:
- Projectile recognizes projects with its heuristics (.git/, maven files, ...), but you can add .projectile file to the project root to explicitly mark it as a project.

* VC (Version Control)

#+begin_src emacs-lisp

  (my/leader-keys
    "g" '("git (version control)" . (keymap))
    "gc" '("resolve conflicts (simple)" . smerge-mode)
    "gC" '("resolve conflicts (advanced)" . smerge-ediff)
  )

#+end_src

- On diffing and merge conflict resolution in emacs ::
  - *General diffing* ::
    =diff= and =ediff= are two common ways in emacs to look at the general difference between buffers/files, =diff= being a simpler option, and =ediff= being a complex one. E.g. there is ~diff~ to check diff between two files, ~diff-buffer-with-file~ to check buffer against file, ... .
  - *Merge conflict resolution* ::
    - =smerge-mode= and =smerge-ediff= are two popular, emacs built-in, ways to resolve merge conflicts, so you don't have to edit the file with conflicts completely manually.
      - =smerge-mode= is simple to use and enough for most of the use cases. It highlights the diffs in the file and offers useful commands for resolving them easily, while letting you manually edit them as normally. So it is not invasive, more like extra capabilities added on top of completely manual workflow, it doesn't introduce its own "view".
      - =smerge-ediff= is more powerful but also quite more complex. It takes you into its own "view" where is visually shows the diff via two buffers + introduces its own keybindings for resolving the conflicts that you then have to use to work with it. I am not sure if you can do manual edits from =ediff='s view or you have to go out of it. People say it is really powerful, but also often overkill and hard to figure out.
    - There is also =vdiff= as a third-party alternative, which also takes over with its own view, similar like =ediff=, but in that view it let's you normally edit the buffers + does more detailed highlighting of changes (allegedly) + is more intuitive to use / has nicer DX. It sounds like a compelling alternative to =ediff=.
    - In =magit=, in its status buffer, if there is a file with merge conflict, pressing ENT will take us to file and open it with =smerge-mode=, while pressing =e= on it will take us to =smerge-ediff= mode. It adds a bit of etra niceties to these in that workflow.
    - Here is also a nice link to magit docs, where they explain /resolving conflicts/ at a high level + show how to do it in =magit=: https://magit.vc/manual/magit/Resolving-Conflicts.html .

** TODO Add a hydra for smerge-mode, to make it easy to run smerge commands in it. Search online for it.
- https://www.reddit.com/r/emacs/comments/a5dmbm/the_fastest_mergeconflict_resolver_in_emacsland/
  - https://github.com/alphapapa/unpackaged.el?tab=readme-ov-file#hydra
- https://github.com/kaushalmodi/.emacs.d/blob/master/setup-files/setup-diff.el#L181

** TODO Configure ediff to work nicer
- found this on reddit:
  #+begin_src emacs-lisp
    '(ediff-split-window-function (quote split-window-horizontally))
    '(ediff-window-setup-function (quote ediff-setup-windows-plain))
  #+end_src
- search for more

** TODO Consider setting up vdiff (as an alternative to ediff)
- https://github.com/justbur/emacs-vdiff
- Allegedly it makes more sense, you can more normally edit the buffers and DX is more intuitive.
  If you also add a hydra, you get the best DX.

** gitstatus.el

=gitstatus.el= gives us an easy way to generate a nice git status message for specific directory.
It is basically a wrapper that calls =gitstatusd= program in the background.

#+begin_src emacs-lisp

  (use-package gitstatus
    :custom
    (gitstatusd-exe "~/.local/bin/gitstatusd")
    (gitstatus-prefix nil)
  )

#+end_src

*** Installing =gitstatusd= on your machine :manual_setup:
Ensure =gitstatus= (which provides =gitstatusd= binary) is installed on your machine.
If it isn't already, you can download the latest binary from the [[https://github.com/romkatv/gitstatus][Github releases]] and e.g. put it into =~/.local/bin/= dir.
Then, make sure that ~gitstatusd-exe~ is set to the path to that binary.
TODO: Figure out why default value of ~gitstatusd-exe~, which is just ~gitstatusd~, doesn't work even when the binary is in PATH, and instead I have to set the exact path. Because if I can make that work that is great, I don't have to adjust the path above manually then.

** Magit

#+begin_src emacs-lisp

  ;; NOTE: I installed transient not because I use it directly, but because magit
  ;;   needs a newer version of it than what comes with emacs by default, and this
  ;;   takes care of it. If magit at some point stops needing it, I can remove this.
  (use-package transient)

  ;; Magit is all you need to work with git.
  ;; TODO: I had to explicitly install new transient above to get magit to work because
  ;;   it expects a newer version than what emacs ships with. Once I update emacs
  ;;   or magit, drop the :after transient and remove (use-package transient) unless
  ;;   I also use it for something else.
  (use-package magit
    :after transient
    :defer t
  )
  ;; I define this outside of (use-package magit) because later is deferred.
  (my/leader-keys
    "gg" 'magit
  )

#+end_src

*** Cheatsheet                                                 :cheatsheet:
Some key combos I often use in magit:
- ~S~ -> stage all changes.
- ~c c~ -> commit all staged changes. ~C-c C-c~ to save commit message while editing it.
- ~h P u~ -> push to origin.

** Highlight lines
=diff-hl= package highlights lines that were modified (compared to versioned state of the file).
It adds indicator to the left margin/side of the window.

#+begin_src emacs-lisp

  (use-package diff-hl
    :config
    (global-diff-hl-mode)
    (my/leader-keys
      "gn" '("next change" . diff-hl-next-hunk)
      "gp" '("previous change" . diff-hl-previous-hunk)
      "gr" '("set ref rev (global)" . diff-hl-set-reference-rev) ;; NOTE: It sets this globally, so in other projects it will cause weird behaviour!
      "gR" '("reset ref rev (global)" . diff-hl-reset-reference-rev)
    )
  )

#+end_src

*** Cheatsheet :cheatsheet:
- ~diff-hl-set-reference-rev~ allows you to define against what are differences shown. E.g. you can set it to =master= to see what changes feature branch branching from =master= introduced.
