vanilla-emacs.d/init.el

;; Show more info for some usages of Ivy. Also allows easier customization of Ivy output.
(use-package ivy-rich
  :after (ivy counsel)
  :config
  ;; This is my custom function for how Ivy shows candidates when finding a file.
  ;; Unlike default function used by ivy(-rich), here I do some additional formatting:
  ;;  - I stylize dot(files/dirs).
  ;;  - I stylize executables.
  (defun my/ivy-read-file-transformer (filename)
    "Transform candidate STR when reading files."
    (let*
      ((current-dir (or (ivy-state-directory ivy-last) default-directory))
      (filepath (expand-file-name filename current-dir))
      (is-dir (ivy--dirname-p filename))
      (is-dotfile (string-prefix-p "." filename))
      (is-exec (file-executable-p filepath))
      )
      (cond
	((and is-dir is-dotfile) (propertize filename 'face '(:inherit (font-lock-comment-face ivy-subdir))))
	(is-dotfile (propertize filename 'face 'font-lock-comment-face))
	(is-dir (propertize filename 'face 'ivy-subdir))
	(is-exec (propertize filename 'face 'font-lock-keyword-face))
	(t filename)
      )
    )
  )

  ;; With ivy-rich-set-columns, you can add new ones or replace existing columns when ivy is used in specific commands.
  ;; For details check out ivy-rich docs and docs of ivy-rich-display-transformers-list .
  (ivy-rich-set-columns
    'counsel-find-file  ; Set columns for this command (therefore when finding file).
    '((my/ivy-read-file-transformer)  ; Use my function instead of default ivy-read-file-transformer.
      (ivy-rich-counsel-find-file-truename (:face font-lock-doc-face))  ; This I kept the same. It adds target for links.
     )
  )

  (ivy-rich-mode 1)
)

;; Projectile brings the concept of "Project" to emacs, as a project on the disk.
(use-package projectile
  :init
  ;; First thing that happens on switching to a new project.
  ;; TODO: Try without this, see if I like that better or not, or if I would like something else.
  (setq projectile-switch-project-action #'projectile-dired)
  :bind-keymap
  ("C-c p" . projectile-command-map) ; TODO: Get this behind SPC.
  :custom
  ((projectile-completion-system 'ivy))
  :config
  (projectile-mode)
)

;; Provides better integration of Projectile and Counsel.
(use-package counsel-projectile
  :config
  (defun counsel-projectile-rg-region-or-symbol ()
    "Search for selected region if active, otherwise search for symbol at point using `counsel-projectile-rg`."
    (interactive)
    (let ((counsel-projectile-rg-initial-input (projectile-symbol-or-selection-at-point)))
        (counsel-projectile-rg)
    )
  )

  (counsel-projectile-mode)
)

(my/leader-keys
  "g" '("git (version control)" . (keymap))
)

(use-package gitstatus
  :custom
  (gitstatusd-exe "~/.local/bin/gitstatusd")
  (gitstatus-prefix nil)
)

;; NOTE: I installed transient not because I use it directly, but because magit
;;   needs a newer version of it than what comes with emacs by default, and this
;;   takes care of it. If magit at some point stops needing it, I can remove this.
(use-package transient)

;; Magit is all you need to work with git.
;; TODO: I had to explicitly install new transient above to get magit to work because
;;   it expects a newer version than what emacs ships with. Once I update emacs
;;   or magit, drop the :after transient and remove (use-package transient) unless
;;   I also use it for something else.
(use-package magit
  :after transient
  :defer t
)
;; I define this outside of (use-package magit) because later is deferred.
(my/leader-keys
  "gg" 'magit
)

(use-package diff-hl
  :config
  (global-diff-hl-mode)
  (my/leader-keys
    "gn" '("next change" . diff-hl-next-hunk)
    "gp" '("previous change" . diff-hl-previous-hunk)
    "gr" '("set ref rev (global)" . diff-hl-set-reference-rev) ;; NOTE: It sets this globally, so in other projects it will cause weird behaviour!
    "gR" '("reset ref rev (global)" . diff-hl-reset-reference-rev)
  )
)
