vanilla-emacs.d/Emacs.org
* Company

#+begin_src emacs-lisp

  ;; TODO: Fix highlight and search faces in tooltip/popup, or have theme that makes them nice. Company has faces that we can customize.
  ;; TODO: Either make scroll more visible, or use lines instead.
  (use-package company
    :custom
    (company-idle-delay 0.2)
    (company-minimum-prefix-length 1)
    (company-selection-wrap-around t)
    (company-format-margin-function 'company-text-icons-margin)
    (company-text-face-extra-attributes '(:weight semi-light :slant italic))
    ;; I found default icons (be it vscode or text) to be too hard to understand,
    ;; so I made my own mapping here that provides more info. For the context, icons are
    ;; short descriptions left of the completion candidates in the popup.
    (company-text-icons-mapping
    '((array          "   []" font-lock-type-face)
      (boolean        " bool" font-lock-builtin-face)
      (class          "class" font-lock-type-face)
      (color          "color" success)
      (constant       "const" font-lock-constant-face)
      (constructor    "cnstr" font-lock-function-name-face)
      (enum-member    "enumv" font-lock-builtin-face)
      (enum           " enum" font-lock-builtin-face)
      (field          "field" font-lock-variable-name-face)
      (file           " file" font-lock-string-face)
      (folder         "  dir" font-lock-doc-face)
      (interface      " intf" font-lock-type-face)
      (keyword        "  kwd" font-lock-keyword-face)
      (method         " mthd" font-lock-function-name-face)
      (function       " func" font-lock-function-name-face)
      (module         "  mdl" font-lock-type-face)
      (numeric        "  num" font-lock-builtin-face)
      (operator       "   op" font-lock-comment-delimiter-face)
      (property       " prop" font-lock-variable-name-face)
      (reference      "  ref" font-lock-doc-face)
      (snippet        " snip" font-lock-string-face)
      (string         "  str" font-lock-string-face)
      (struct         "strct" font-lock-variable-name-face)
      (text           " text" shadow)
      (type-parameter "typep" font-lock-type-face)
      (unit           " unit" shadow)
      (value          "  val" font-lock-builtin-face)
      (variable       "  var" font-lock-variable-name-face)
      (t              "    ." shadow))
    )
    :config
    (global-company-mode 1)
  )

#+end_src

** TODO Find a way to also show additional docs next to each item. E.g. company-box
But company-box currently overrides my setting for company-text-icons-mapping with its icons and is for some reason slow.

** Cheatsheet :cheatsheet:
- C-s to search among the candidates. C-M-s to not just highlight but also filter. C-g to quit search mode.
  
* Terminal (shell)

There are different ways to use terminal / shell in Emacs. There are implementations that are completely done in elisp, there are implementations that support all that normal terminal does, and then there are does that don't support ncurses / TUI or all ansi codes.

I chose ~vterm~ because it uses external ~libvterm~ implementation of a terminal in C, which means it is fast, stable, and supports everything that a terminal should. It is also very popular and well supported.

#+begin_src emacs-lisp

  ;; Requires some stuff like cmake, support for modules in emacs, libtool-bin, but most systems /
  ;; emacses have all those ready, so usually you don't have to think about it.
  (use-package vterm
    ;; hl-line highlight flickers in vterm, so we turn it off.
    ;; Relevant github issue: https://github.com/akermu/emacs-libvterm/issues/432 .
    :hook (vterm-mode . (lambda () (setq-local global-hl-line-mode nil)))
    :config
    (defun my/vterm-new ()
      (interactive)
      (vterm t)
    )
    (my/leader-keys
      "\"" '("new terminal" . my/vterm-new)
    )
    (evil-define-key 'normal vterm-mode-map (kbd "C-p") 'vterm-send-up)
    (evil-define-key 'normal vterm-mode-map (kbd "C-n") 'vterm-send-down)
  )

  ;; Allows easy toggling of terminal(vterm) window.
  (use-package vterm-toggle
    :after (vterm)
    :config
    (my/leader-keys
      "'" '("toggle terminal" . vterm-toggle)
    )
    ;; If I press C-return after toggling to terminal window, it will insert `cd` command that takes
    ;; me to dir of previous buffer! Very useful.
    (define-key vterm-mode-map [(control return)] #'vterm-toggle-insert-cd)
  )

#+end_src

** My custom hook that triggers on prompt in vterm

#+begin_src emacs-lisp

  (with-eval-after-load 'vterm
    (defvar my/vterm-prompt-hook nil "A hook that runs each time the prompt is printed in vterm.")

    (defun my/run-vterm-prompt-hooks ()
      "Runs my/vterm-prompt-hook hooks."
      (run-hooks 'my/vterm-prompt-hook)
    )

    (with-eval-after-load 'vterm
      ;; If OSC sequence "prompt" is printed in the terminal, `my/run-vterm-prompt-hook'
      ;; will be run.
      (add-to-list 'vterm-eval-cmds '("prompt" my/run-vterm-prompt-hooks))
    )
  )

#+end_src

*** Adding special OSC sequence to the prompt :manual_setup:
In order for us to be able to detect the prompt and run the hooks based on it, terminal prompt needs to contain the OSC sequence ~\[\e]51;Eprompt\a\]~.
Check [[*Shell-side configuration for vterm]] below for exact details.

** My custom header line in vterm (git status, path)

On vterm mode (so effectively for any new vterm buffer), I set a header line for that buffer that shows current working directory and its git status.
In Emacs, header line refreshes on every buffer change, and its ~:eval~ forms are evaluated every time.
Since calculation of git status is both somewhat expensive and done asynchronously (by =gitstatusd=), I don't do it directly in the ~:eval~ form.
Instead, I use an intermediary variable ~my/vterm-git-status-string~ that is evaled/read in header line via ~:eval~, and is separately updated by the git status calculation, which is run only on every new prompt in the terminal.

#+begin_src emacs-lisp

  (with-eval-after-load 'vterm
    (defvar-local my/vterm-git-status-string nil
      "A pretty string that shows git status of the current working directory in vterm.")

    ;; TODO: Sometimes, vterm hides top line under the header-line. But not always. It starts in right
    ;; place, and commands like "go to first line" work correctly, but I press enter and new line in
    ;; vterm appears, whole buffer shifts for one line up and the first line becomes hidden. Figure
    ;; out how to fix this.
    (defun my/vterm-set-header-line ()
      "Display the header line that shows vterm's current dir and git status.
  It gets git status string from `my/vterm-git-status-string' variable each time it renders."
      (setq header-line-format
            '((:eval (when my/vterm-git-status-string (concat " " my/vterm-git-status-string " ❯ ")))
              (:propertize
               (:eval (abbreviate-file-name default-directory))
               face font-lock-comment-face
              )
             )
      )
      ;; Setting :box of header line to have an "invisible" line (same color as background) is the trick
      ;; to add some padding to the header line.
      (face-remap-add-relative
       'header-line
       `(:box (:line-width 6 :color ,(face-attribute 'header-line :background nil t)))
      )
    )
    (add-hook 'vterm-mode-hook 'my/vterm-set-header-line)

    (with-eval-after-load 'gitstatus
      (defun my/obtain-vterm-git-status-string ()
        "Obtains the git status for the current directory of the vterm buffer.
  It builds a pretty string based showing it and stores it in `my/vterm-git-status-string' var.
  It uses external `gitstatusd' program to calculate the actual git status."
        (gitstatusd-get-status
         default-directory
         (lambda (res)
           (let ((status-string (gitstatus-build-str res)))
             (when (not (equal my/vterm-git-status-string status-string))
               (setq my/vterm-git-status-string (gitstatus-build-str res))
               (force-mode-line-update)
             )
           )
         )
        )
      )
      (add-hook 'my/vterm-prompt-hook 'my/obtain-vterm-git-status-string)
    )
  )

#+end_src

** Shell-side configuration for vterm :manual_setup:

Some of the most useful vterm features require us to do a bit of configuration of the shell on our system. We can do without it, but we will be missing some of the functionality.
=vterm= brings that config, for our convenience, as one .sh file that we need to load in our .bashrc.
This can be done with the snippet below, by putting it into =.bashrc= (as per vterm docs).
It assumes vterm's =etc/= dir is next to where vterm is installed. This was true for me when installing it via Elpaca.

#+begin_src bash :tangle no

  if [[ "$INSIDE_EMACS" = 'vterm' ]] \
      && [[ -n ${EMACS_VTERM_PATH} ]] \
      && [[ -f ${EMACS_VTERM_PATH}/etc/emacs-vterm-bash.sh ]]; then
          source ${EMACS_VTERM_PATH}/etc/emacs-vterm-bash.sh
  fi

#+end_src

To override the default prompt to be much simpler (since I show info from it in the header line, check [[*My custom header line in vterm (git status, path)]]), add the following snippet into =.bashrc=, somewhere after the prompt (~PS1~) definition:
*NOTE*: This ~\[\e]51;Eprompt\a\]~ at the end is OSC sequence I added to detect the prompt and to be able then to run functions based on its appearance (check ~vterm-eval-cmds~, and ~my/vterm-prompt-hook~). For more details check [[*My custom hook that triggers on prompt in vterm]] .

#+begin_src bash :tangle no

  if [ "$INSIDE_EMACS" = 'vterm' ]; then
    export PS1="${Bold}${Purple}Ɛ ∷ ${Color_Off}\[\e]51;Eprompt\a\]"
  fi

#+end_src

*** TODO Might be cool if I could tangle these code snippets directly into .bashrc, or a separate file that .bashrc will load. Then this would become real part of emacs config instead of a manual step.
