vanilla-emacs.d/init.el

;; TODO: Fix highlight and search faces in tooltip/popup, or have theme that makes them nice. Company has faces that we can customize.
;; TODO: Either make scroll more visible, or use lines instead.
(use-package company
  :custom
  (company-idle-delay 0.2)
  (company-minimum-prefix-length 1)
  (company-selection-wrap-around t)
  (company-format-margin-function 'company-text-icons-margin)
  (company-text-face-extra-attributes '(:weight semi-light :slant italic))
  ;; I found default icons (be it vscode or text) to be too hard to understand,
  ;; so I made my own mapping here that provides more info. For the context, icons are
  ;; short descriptions left of the completion candidates in the popup.
  (company-text-icons-mapping
  '((array          "   []" font-lock-type-face)
    (boolean        " bool" font-lock-builtin-face)
    (class          "class" font-lock-type-face)
    (color          "color" success)
    (constant       "const" font-lock-constant-face)
    (constructor    "cnstr" font-lock-function-name-face)
    (enum-member    "enumv" font-lock-builtin-face)
    (enum           " enum" font-lock-builtin-face)
    (field          "field" font-lock-variable-name-face)
    (file           " file" font-lock-string-face)
    (folder         "  dir" font-lock-doc-face)
    (interface      " intf" font-lock-type-face)
    (keyword        "  kwd" font-lock-keyword-face)
    (method         " mthd" font-lock-function-name-face)
    (function       " func" font-lock-function-name-face)
    (module         "  mdl" font-lock-type-face)
    (numeric        "  num" font-lock-builtin-face)
    (operator       "   op" font-lock-comment-delimiter-face)
    (property       " prop" font-lock-variable-name-face)
    (reference      "  ref" font-lock-doc-face)
    (snippet        " snip" font-lock-string-face)
    (string         "  str" font-lock-string-face)
    (struct         "strct" font-lock-variable-name-face)
    (text           " text" shadow)
    (type-parameter "typep" font-lock-type-face)
    (unit           " unit" shadow)
    (value          "  val" font-lock-builtin-face)
    (variable       "  var" font-lock-variable-name-face)
    (t              "    ." shadow))
  )
  :config
  (global-company-mode 1)
)

;; Requires some stuff like cmake, support for modules in emacs, libtool-bin, but most systems /
;; emacses have all those ready, so usually you don't have to think about it.
(use-package vterm
  ;; hl-line highlight flickers in vterm, so we turn it off.
  ;; Relevant github issue: https://github.com/akermu/emacs-libvterm/issues/432 .
  :hook (vterm-mode . (lambda () (setq-local global-hl-line-mode nil)))
  :config
  (defun my/vterm-new ()
    (interactive)
    (vterm t)
  )
  (my/leader-keys
    "\"" '("new terminal" . my/vterm-new)
  )
  (evil-define-key 'normal vterm-mode-map (kbd "C-p") 'vterm-send-up)
  (evil-define-key 'normal vterm-mode-map (kbd "C-n") 'vterm-send-down)
)

;; Allows easy toggling of terminal(vterm) window.
(use-package vterm-toggle
  :after (vterm)
  :config
  (my/leader-keys
    "'" '("toggle terminal" . vterm-toggle)
  )
  ;; If I press C-return after toggling to terminal window, it will insert `cd` command that takes
  ;; me to dir of previous buffer! Very useful.
  (define-key vterm-mode-map [(control return)] #'vterm-toggle-insert-cd)
)

(with-eval-after-load 'vterm
  (defvar my/vterm-prompt-hook nil "A hook that runs each time the prompt is printed in vterm.")

  (defun my/run-vterm-prompt-hooks ()
    "Runs my/vterm-prompt-hook hooks."
    (run-hooks 'my/vterm-prompt-hook)
  )

  (with-eval-after-load 'vterm
    ;; If OSC sequence "prompt" is printed in the terminal, `my/run-vterm-prompt-hook'
    ;; will be run.
    (add-to-list 'vterm-eval-cmds '("prompt" my/run-vterm-prompt-hooks))
  )
)

(with-eval-after-load 'vterm
  (defvar-local my/vterm-git-status-string nil
    "A pretty string that shows git status of the current working directory in vterm.")

  ;; TODO: Sometimes, vterm hides top line under the header-line. But not always. It starts in right
  ;; place, and commands like "go to first line" work correctly, but I press enter and new line in
  ;; vterm appears, whole buffer shifts for one line up and the first line becomes hidden. Figure
  ;; out how to fix this.
  (defun my/vterm-set-header-line ()
    "Display the header line that shows vterm's current dir and git status.
It gets git status string from `my/vterm-git-status-string' variable each time it renders."
    (setq header-line-format
          '((:eval (when my/vterm-git-status-string (concat " " my/vterm-git-status-string " ❯ ")))
            (:propertize
             (:eval (abbreviate-file-name default-directory))
             face font-lock-comment-face
            )
           )
    )
    ;; Setting :box of header line to have an "invisible" line (same color as background) is the trick
    ;; to add some padding to the header line.
    (face-remap-add-relative
     'header-line
     `(:box (:line-width 6 :color ,(face-attribute 'header-line :background nil t)))
    )
  )
  (add-hook 'vterm-mode-hook 'my/vterm-set-header-line)

  (with-eval-after-load 'gitstatus
    (defun my/obtain-vterm-git-status-string ()
      "Obtains the git status for the current directory of the vterm buffer.
It builds a pretty string based showing it and stores it in `my/vterm-git-status-string' var.
It uses external `gitstatusd' program to calculate the actual git status."
      (gitstatusd-get-status
       default-directory
       (lambda (res)
         (let ((status-string (gitstatus-build-str res)))
           (when (not (equal my/vterm-git-status-string status-string))
             (setq my/vterm-git-status-string (gitstatus-build-str res))
             (force-mode-line-update)
           )
         )
       )
      )
    )
    (add-hook 'my/vterm-prompt-hook 'my/obtain-vterm-git-status-string)
  )
)
