vanilla-emacs.d/Emacs.org
** Cheatsheet :cheatsheet:
- After toggling to terminal window, press C-return to cd into parent dir of previous buffer.
- To execute commands like Ctrl-C or Ctrl-D, prefix them with `C-c`, so e.g. `C-c C-c` or `C-c C-d`.


** TODO Try "eat" terminal
** TODO Explore multi-vterm package.

* Spell checking
Flyspell is a builtin spell-checking frontend for Emacs, but there are also popular community packages, one of the lately most popular being Jinx, which I use here.

Main concept with all spell-checking frontends is that you have to install an actual spell-checker, that is not emacs-specific, on your system, and they use it as a backend. Most popular are Aspell and Hunspell, while Enchant is a wrapper on top of all these that does some extra smart stuff. Jinx uses Enchant.

** Jinx

Jinx uses Enchant program on your machine, which uses spelling backends like hunspell and/or aspell, which use their dictionaries for specific languages.

#+begin_src emacs-lisp

  (use-package jinx
    :config
    (setq jinx-languages "en_us")
    (my/leader-keys
      "tc"  '("spell checking" . jinx-mode)
    )
  )

#+end_src

*** Manual setup                                             :manual_setup:

On Arch, install ~enchant~ and ~pkgconf~.
Enchant needs to use some spelling backend, so also install e.g. ~hunspell~ (and make sure it is using it when I expect, file =/usr/share/enchant-2/enchant.ordering= on Arch defines that).
Finally, that backend needs dictionaries for the languages I want to spell-check, so e.g. if I want english, I should install ~hunspell-en_us~.
I can check backend and dictionaries that Enchant is picking up by running ~enchant-lsmod-2 -list-dicts~.

*** Cheatsheet :cheatsheet:

Run ~jinx-correct~ to correct the word at point.

* Syntax/error checking
** Flycheck

Flycheck is the central package for syntax checking, a "frontend" for code-related errors.
Given backend(s) (e.g. LSP, linter, ...) that supply errors (and warnings, info, ...), it collects errors from them and visualizes and manipulates them in a unified way.
It marks the affected piece of code visually (squigly lines), gives a way to move through the errors quickly, ... .
By default, it shows full error message(s) in the minibuffer when cursor is at the place of the error.

I currently configured it in the following way:
- I configure backends per language, but most often it is LSP.
- Instead of showing full error(s) in minibuffer when point/cursor is at the place of error, Flycheck shows short error message (1 line) via the sideline.
- If I want to see the full error message at point/cursor, I have a command (and keybinding) I can invoke to do so.

#+begin_src emacs-lisp

  (use-package flycheck
    :init (global-flycheck-mode)
    :custom
    (flycheck-display-errors-delay 0) ; Default value is 0.9.
    :config
    (my/leader-keys
      "en"  '("next" . flycheck-next-error)
      "ep"  '("previous" . flycheck-previous-error)
      "el"  '("list" . flycheck-list-errors)
    )
  )

#+end_src

#+begin_src emacs-lisp

  ;; Shows flycheck errors/warnings in a popup, instead of a minibuffer which is default.
  ;; I configured it so it doesn't show them on cursor, as is default, but on request.
  (use-package flycheck-posframe
    :after flycheck
    :custom
    (flycheck-posframe-border-width 10)
    (flycheck-posframe-prefix nil)
    ;; Don't show errors automatically on cursor, since below we define a manual way to invoke
    ;; showing of errors at point. I do it this way because I configured automatic showing of first
    ;; line of errors in the sideline, so I don't need to also see the whole error all the time,
    ;; instead I will rather invoke it manually when I want to see the whole of it.
    (flycheck-display-errors-function nil)
    :config
    (set-face-attribute 'flycheck-posframe-warning-face nil :inherit 'warning)
    (set-face-attribute 'flycheck-posframe-error-face nil :inherit 'error)
    ;; TODO: Make the posframe(popup) visually nicer.

    (defun my/show-flycheck-errors-posframe-at-point ()
      (interactive)
      (let* ((errs (flycheck-overlay-errors-at (point))))
        (flycheck-posframe-show-posframe errs)
      )
    )
    (my/leader-keys
      "ee" '("(un)expand" . my/show-flycheck-errors-posframe-at-point)
    )
  )

#+end_src

*** Show errors inline                                              :inactive:

While I got this to work quite nicely, I found that code inline can be pretty confusing, as it keeps popping in and out and moving the code you are reading, even when you don't care about the error at that moment.
Showing just one line by default helped, but I still didn't like it, and ended up going instead for the sideline for 1 line and then posframe for the full error.

#+begin_src emacs-lisp :tangle no

  ;; Shows flycheck errors/warnings inline (in code, below the cursor), instead of a minibuffer which is default.
  (use-package flycheck-inline
    :after (quick-peek)
    :hook (flycheck-mode . flycheck-inline-mode)
    :config

    ;;; Below I configure stuff quite heavily!
    ;;; We display only first line for each error + define a command for (un)expanding errors under the cursor/point.
    ;;; We use quick-peek for nice borders around the overlay.

    (defvar my/expanded-flycheck-errors nil
      "List of flycheck errors that are to be shown with a full message.")

    (defun my/toggle-flycheck-errors-expansion-at-point ()
      "Adds flycheck errors at point to the list of expanded errors if not already expanded.
       If already in the list, it removes them from the list."
      (interactive)
      (let* ((errs (flycheck-overlay-errors-at (point))))
        (setq my/expanded-flycheck-errors (if (cl-intersection errs my/expanded-flycheck-errors) nil errs))
      )
    )
    (my/leader-keys
      "ee" '("(un)expand" . my/toggle-flycheck-errors-expansion-at-point)
    )

    (defun my/shorten-flycheck-error-message (msg)
      "Shorten the error message MSG to the first line, adding ellipsis if so."
      (let ((lines (split-string msg "\n")))
        (if (> (length lines) 1)
            (concat (car lines) (propertize " …" 'face 'bold))
          (car lines)
        )
      )
    )

    ;; Use quick-peek to show errors in a nicer way (with bars).
    ;; If error is in the my/expanded-flycheck-errors list, I show its full message,
    ;; if not, I show shortened version of it.
    (setq flycheck-inline-display-function (lambda (msg pos err)
  					   (let* ((ov (quick-peek-overlay-ensure-at pos))
  						  (contents (quick-peek-overlay-contents ov))
                                                    (show-full-msg (member err my/expanded-flycheck-errors))
  						 )
  					     (setf (quick-peek-overlay-contents ov)
  						   (concat contents
  							   (when contents "\n")
  							   (if show-full-msg msg (my/shorten-flycheck-error-message msg)))
  					     )
  					     (quick-peek-update ov)
                                             )
  					 )
  	flycheck-inline-clear-function 'quick-peek-hide
    )
  )

#+end_src

** Flymake                                                          :inactive:

Im not using it for now since I managed to set up Flycheck quite well, but I might want to try it out in the future again.

#+begin_src emacs-lisp :tangle no

  (use-package flymake
    :ensure nil ; It already comes with emacs, so we tell elpaca not to install it.
    :hook (prog-mode . flymake-mode)
    :custom
    (flymake-no-changes-timeout 0.2)
    :config
    (my/leader-keys
      "en"  '("next" . flymake-goto-next-error)
      "ep"  '("previous" . flymake-goto-prev-error)
      "el"  '("list (buffer)" . flymake-show-buffer-diagnostics)
      "eL"  '("list (project)" . flymake-show-project-diagnostics)
    )
  )

  (use-package flymake-posframe
    :ensure (:host github :repo "Ladicle/flymake-posframe")
    :hook (flymake-mode . flymake-posframe-mode)
  )

#+end_src

* Sideline

=sideline= package shows information (e.g. errors) inline with the code, but on the right (or left) edge of the screen.
It shows that infomation in a smart way, to minimally disrupt the existing code.

You can plug in multiple backends into it, and it will display the information uniformly.

#+begin_src emacs-lisp

  (use-package sideline
    :hook ((flycheck-mode lsp-mode) . sideline-mode)
    :init
    ;; `up` means it is shown above the line where cursor is, `down` means beneath it.
    (setq sideline-backends-right '((sideline-flycheck . up)
  				  (sideline-lsp . down)))
  )

  (use-package sideline-flycheck 
    :hook (flycheck-mode . sideline-flycheck-setup)
    :custom
    ;; I want to show only short version of errors, otherwise it becomes a mess.
    ;; If I need to see the full error, I have other methods to do that (e.g. flycheck-posframe).
    (sideline-flycheck-max-lines 1)
    :config
    (set-face-attribute 'sideline-flycheck-error nil
  		      :slant 'italic
  		      :background "black")
    (set-face-attribute 'sideline-flycheck-warning nil
  		      :weight 'light
  		      :slant 'italic
  		      :background "black")
    (set-face-attribute 'sideline-flycheck-success nil
  		      :weight 'light
  		      :slant 'italic
  		      :background "black")
    ;; TODO: Somehow define following prefixes ✖ ⓘ ⚠ for errors / warning / success?
  )

  ;; From LSP directly, I show only code actions in the sideline.
  ;; The rest of the information I show in other way (via flycheck, via minibuffer, popups, ...).
  ;; Note that flycheck again sends some of that information to sideline though.
  (use-package sideline-lsp
    :custom
    ;; By setting this to nil, lsp diagnostics (errors, warnings) get sent to flycheck, which we prefer since
    ;; it is a more standard / specific way to do it.
    (sideline-lsp-show-diagnostics nil)
    (sideline-lsp-show-hover nil) ; This I already show in minibuffer (eldoc) or in popup (lsp-ui-doc).
    (sideline-lsp-show-symbol nil) ; This I didn't find useful.
    (sideline-lsp-show-code-actions t) ; But I do find it useful to see code actions.
    (sideline-lsp-code-actions-prefix "✎ ")
    (sideline-lsp-actions-kind-regex "quickfix.*") ; Show only quickfix code actions, otherwise it is too much noise.
    :config
    (set-face-attribute 'sideline-lsp-code-action nil
                        :inherit 'shadow
                        :weight 'light
  		      :slant 'italic
  		      :background "black")
  )

#+end_src

* Folding

#+begin_src emacs-lisp

  (use-package hideshow
    :ensure nil ; emacs built-in
    :hook (prog-mode . hs-minor-mode)
  )

#+end_src

** Cheatsheet                                                   :cheatsheet:
- =hideshow= works by default with evil keybindings for folding:
  - ~z a~ to (un)fold at point
  - ~z r~ to unfold all
  - ~z m~ to fold all
  - ~z 0~ to unfold recursively
  - ...
** TODO Try some richer package for folding, e.g. origami or treesit-fold
* Development
