vanilla-emacs.d/init.el

(use-package jinx
  :config
  (setq jinx-languages "en_us")
  (my/leader-keys
    "tc"  '("spell checking" . jinx-mode)
  )
)

(use-package flycheck
  :init (global-flycheck-mode)
  :custom
  (flycheck-display-errors-delay 0) ; Default value is 0.9.
  :config
  (my/leader-keys
    "en"  '("next" . flycheck-next-error)
    "ep"  '("previous" . flycheck-previous-error)
    "el"  '("list" . flycheck-list-errors)
  )
)

;; Shows flycheck errors/warnings in a popup, instead of a minibuffer which is default.
;; I configured it so it doesn't show them on cursor, as is default, but on request.
(use-package flycheck-posframe
  :after flycheck
  :custom
  (flycheck-posframe-border-width 10)
  (flycheck-posframe-prefix nil)
  ;; Don't show errors automatically on cursor, since below we define a manual way to invoke
  ;; showing of errors at point. I do it this way because I configured automatic showing of first
  ;; line of errors in the sideline, so I don't need to also see the whole error all the time,
  ;; instead I will rather invoke it manually when I want to see the whole of it.
  (flycheck-display-errors-function nil)
  :config
  (set-face-attribute 'flycheck-posframe-warning-face nil :inherit 'warning)
  (set-face-attribute 'flycheck-posframe-error-face nil :inherit 'error)
  ;; TODO: Make the posframe(popup) visually nicer.

  (defun my/show-flycheck-errors-posframe-at-point ()
    (interactive)
    (let* ((errs (flycheck-overlay-errors-at (point))))
      (flycheck-posframe-show-posframe errs)
    )
  )
  (my/leader-keys
    "ee" '("(un)expand" . my/show-flycheck-errors-posframe-at-point)
  )
)

(use-package sideline
  :hook ((flycheck-mode lsp-mode) . sideline-mode)
  :init
  ;; `up` means it is shown above the line where cursor is, `down` means beneath it.
  (setq sideline-backends-right '((sideline-flycheck . up)
				  (sideline-lsp . down)))
)

(use-package sideline-flycheck 
  :hook (flycheck-mode . sideline-flycheck-setup)
  :custom
  ;; I want to show only short version of errors, otherwise it becomes a mess.
  ;; If I need to see the full error, I have other methods to do that (e.g. flycheck-posframe).
  (sideline-flycheck-max-lines 1)
  :config
  (set-face-attribute 'sideline-flycheck-error nil
		      :slant 'italic
		      :background "black")
  (set-face-attribute 'sideline-flycheck-warning nil
		      :weight 'light
		      :slant 'italic
		      :background "black")
  (set-face-attribute 'sideline-flycheck-success nil
		      :weight 'light
		      :slant 'italic
		      :background "black")
  ;; TODO: Somehow define following prefixes ✖ ⓘ ⚠ for errors / warning / success?
)

;; From LSP directly, I show only code actions in the sideline.
;; The rest of the information I show in other way (via flycheck, via minibuffer, popups, ...).
;; Note that flycheck again sends some of that information to sideline though.
(use-package sideline-lsp
  :custom
  ;; By setting this to nil, lsp diagnostics (errors, warnings) get sent to flycheck, which we prefer since
  ;; it is a more standard / specific way to do it.
  (sideline-lsp-show-diagnostics nil)
  (sideline-lsp-show-hover nil) ; This I already show in minibuffer (eldoc) or in popup (lsp-ui-doc).
  (sideline-lsp-show-symbol nil) ; This I didn't find useful.
  (sideline-lsp-show-code-actions t) ; But I do find it useful to see code actions.
  (sideline-lsp-code-actions-prefix "✎ ")
  (sideline-lsp-actions-kind-regex "quickfix.*") ; Show only quickfix code actions, otherwise it is too much noise.
  :config
  (set-face-attribute 'sideline-lsp-code-action nil
                      :inherit 'shadow
                      :weight 'light
		      :slant 'italic
		      :background "black")
)

(use-package hideshow
  :ensure nil ; emacs built-in
  :hook (prog-mode . hs-minor-mode)
)
