vanilla-emacs.d/Emacs.org
** LSP
LSP (Language Server Protocol) enables editors to use language servers (that usually come with the language itself) to answer all kinds of questions about the code in that language, with full semantic understanding of the project.

LSP as a general protocol has some of its own nomenclature. Some of it that is useful to know to better understand the config below, is how they name the most important information that LS returns.
 - =hover= info: Documentation about the symbol/function/thing under the cursor that LS sends.
 - =diagnostics=: Errors, warnings, info, that LS reports.
 - =code actions=: actions that LS suggests and that you can then ask it to execute. E.g. add missing import.

Rough summary how my configuration currently displays all this info:
 - Parts of code with diagnostics are marked with **squiggly lines** (by Fly(check/make)).
 - **Short version of hover** info for a symbol is shown on cursor/mouse, in the minibuffer (by ~eldoc~).
 - **Full version of hover** info for a symbol under cursor is displayed in a popup, on demand, which I trigger with "K" or "?" (by ~lsp-ui-doc~).
 - Short info / **diagnostics** for thing/error under the cursor is shown on the right side of the screen, next to the code (sideline), including errors (just one line), warnings and **code actions**.
 - Full info for thing/eror under the cursor is shown by ~fly(check/make)~, in a popup, on request.

One functionality that LSP also defines are =semantic tokens=, where LS returns semantic information about specific tokens, which is then usually used by the editor for very detailed and smart syntax highlighting.
It is important to notice here that it doesn't return this information for every single token in the code, but only for specific types of tokens, meaning it can't be used to fully highlight the code. Instead, it is intended to be used as an additional, detailed syntax highlighting that is applied on top of some other, more basic syntax highlighting (i.e. usually implemented via regexes, textmate grammar, or recently treesitter). Additionally, LSP semantic token syntax highlighting is usually slower and less robust to syntax errors than other more basic methods, but those are secondary reasons.
Therefore, for optimal experience, we should customize the faces used for semantic tokens to be aligned with the faces used for basic highlighting, per language if needed.
**NOTE**: For stacking of syntax highlights to happen correctly, it is important that basic syntax highlighting (e.g. treesitter) is applied first, and then lsp semantic token syntax highlighting after it.

#+begin_src emacs-lisp

  (use-package lsp-mode
    :init
    (setq lsp-keymap-prefix ",")
    (setq lsp-use-plists t) ; Recommended performance optimization. Requires setting env var (check early-init.el block below).
    :hook (lsp-mode . lsp-enable-which-key-integration)
    :commands (lsp lsp-deferred)
    :custom
    ;; lsp-modeline is about showing "stats" in the modeline: number of errors, warnings, code actions.
    ;; Useful for languages where compilation might be broken due to errors in other files (e.g. Java, Haskell).
    (lsp-modeline-diagnostics-enable t) ; Show info about diagnostics (errors, warnings, ...) in the modeline.
    (lsp-modeline-diagnostics-scope :workspace) ; Whole project and not just this file.
    (lsp-modeline-code-actions-enable t) ; Show info about code actions in the modeline.

    ;; eldoc is the most "native" way for emacs to display docs for a thing under cursor.
    ;; It displays information about the thing under cursor/mouse in the minibuffer.
    ;; Here we tell lsp-mode to use eldoc to display "hover" lsp info (which is docs for function/symbol).
    (lsp-eldoc-enable-hover t)
    ;; Don't show all the info in minibuffer on hover, instead show only most basic info (what it is, type).
    ;; Otherwise, there is too much noise and jumping of minibuffer up and down.
    ;; If I want full docs for a thing under cursor, I will rather summon it manually: I use lsp-ui-docs-toggle for that and have bound it to "?" -> check lsp ui config for details.
    (lsp-eldoc-render-all nil)

    ;; At the top of the file, show info about the position of the cursor (path, module, symbol, ...).
    (lsp-headerline-breadcrumb-enable t)
    (lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))

    ;; Turned off for now, I found it to bee too much of a "rainbow soup".
    ;;(lsp-semantic-tokens-enable t) ; Richer highlighting (e.g. differentiates function symbol from var symbol).
    :config
    (general-define-key :states '(normal)
                        :keymaps 'lsp-mode-map
                        "," lsp-command-map
    )
  )

#+end_src

#+begin_src emacs-lisp :tangle ./early-init.el

  (setenv "LSP_USE_PLISTS" "true") ; Recommended performance optimization. Also neccessary for lsp-booster below to work.

#+end_src

*** lsp-ui

Official extension for lsp-mode that brings the nice UI features, mostly for displaying info returned by LS.
It is common to use it next to lsp-mode.
It can show information in two main ways: via ~lsp-ui-doc~ popup, or inline via ~lsp-ui-sideline~.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :after (lsp-mode evil)
    :commands lsp-ui-mode
    :custom
    ;; Show "hover" documentation for a thing under cursor/pointer in a popup.
    (lsp-ui-doc-enable t)
    ;; I don't want it to popup constantly as I move around, instead I want to summon it when I need it.
    ;; That is why below I define "?" as a key for toggling it.
    (lsp-ui-doc-show-with-cursor nil)
    ;; If I hover with a mouse, then do show the docs, that is not too intrusive.
    (lsp-ui-doc-show-with-mouse t)
    ;; Show the docs next to the cursor/point.
    (lsp-ui-doc-position 'at-point)
    (lsp-ui-doc-include-signature t)
    (lsp-ui-doc-max-height 30)

    ;; lsp-ui-sideline shows info that you want (e.g. diagnostics, code actions, ...)  on the right
    ;; side of the window, inline with the code.  We set it to nil here though, because we control
    ;; it from another package, sideline + sideline-lsp.
    (lsp-ui-sideline-enable nil)
    :config
    (general-define-key :states '(normal visual)
                        :keymaps 'lsp-mode-map
                        "?" 'lsp-ui-doc-glance ; TODO: This is sometimes being overshadowed with ? from evil mode, fix that.
                        "F" 'lsp-ui-doc-focus-frame
    ) 
    (setq evil-lookup-func 'lsp-ui-doc-glance)
  )

#+end_src

*** lsp-booster

Both =lsp-mode= and =elgot= in emacs have the issue where emacs can get frozen when dealing with large amounts of data coming from / going to some language server.
Solution to this is =lsp-booster=: standalone binary that serves as a proxy in between emacs and language servers and buffers the traffic as needed (and is multi-threaded).
To get it to work we need to both install the binary (check "manual setup" below) and to wrap the language server calls in emacs to work with this proxy (which does the elisp code below).

I copied the code below exactly as it is from the =lsp-booster= Github's README (~v0.2.1~):

#+begin_src emacs-lisp

  (defun lsp-booster--advice-json-parse (old-fn &rest args)
    "Try to parse bytecode instead of json."
    (or
    (when (equal (following-char) ?#)
      (let ((bytecode (read (current-buffer))))
        (when (byte-code-function-p bytecode)
          (funcall bytecode))))
    (apply old-fn args)))
  (advice-add (if (progn (require 'json)
                        (fboundp 'json-parse-buffer))
                  'json-parse-buffer
                'json-read)
              :around
              #'lsp-booster--advice-json-parse)

  (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
    "Prepend emacs-lsp-booster command to lsp CMD."
    (let ((orig-result (funcall old-fn cmd test?)))
      (if (and (not test?)                             ;; for check lsp-server-present?
              (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
              lsp-use-plists
              (not (functionp 'json-rpc-connection))  ;; native json-rpc
              (executable-find "emacs-lsp-booster"))
          (progn
            (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
              (setcar orig-result command-from-exec-path))
            (message "Using emacs-lsp-booster for %s!" orig-result)
            (cons "emacs-lsp-booster" orig-result))
        orig-result)))
  (advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)

#+end_src

**** Manual setup :manual_setup:
I followed instructions from the =lsp-booster= Github's README:
- Downloaded the latest binary from the Github releases and made it available on =PATH= (I put it into =~/opt= dir).

*** Misc

#+begin_src emacs-lisp

  ;; Brings lsp-ivy-workspace-symbol that searches for a symbol in project as you type its name.
  ;; TODO: Add a keybinding, under lsp-keymap-prefix, for this command, I guess under goto? So ", g s"?
  (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

  ;; Shows list of all errors in a nice treemacs fashion.
  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

#+end_src

*** NOTE eglot vs lsp-mode
I investigated lsp-mode vs eglot. Eglot natively comes with emacs and is alternative to lsp-mode. Claims to have better code and be faster, but lsp-mode seems to be bigger and more featureful, so it is really not clear at all which is better. I think I will be sticking to lsp-mode for now, people seemed to report more issues with eglot, and lsp-mode I know works well. I can try eglot at some point.
*** TODO LSP's completion-at-point -> how to get that working with Company properly?
- https://emacs-lsp.github.io/lsp-mode/page/settings/completion/ -> useful?

