vanilla-emacs.d/init.el

(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix ",")
  (setq lsp-use-plists t) ; Recommended performance optimization. Requires setting env var (check early-init.el block below).
  :hook (lsp-mode . lsp-enable-which-key-integration)
  :commands (lsp lsp-deferred)
  :custom
  ;; lsp-modeline is about showing "stats" in the modeline: number of errors, warnings, code actions.
  ;; Useful for languages where compilation might be broken due to errors in other files (e.g. Java, Haskell).
  (lsp-modeline-diagnostics-enable t) ; Show info about diagnostics (errors, warnings, ...) in the modeline.
  (lsp-modeline-diagnostics-scope :workspace) ; Whole project and not just this file.
  (lsp-modeline-code-actions-enable t) ; Show info about code actions in the modeline.

  ;; eldoc is the most "native" way for emacs to display docs for a thing under cursor.
  ;; It displays information about the thing under cursor/mouse in the minibuffer.
  ;; Here we tell lsp-mode to use eldoc to display "hover" lsp info (which is docs for function/symbol).
  (lsp-eldoc-enable-hover t)
  ;; Don't show all the info in minibuffer on hover, instead show only most basic info (what it is, type).
  ;; Otherwise, there is too much noise and jumping of minibuffer up and down.
  ;; If I want full docs for a thing under cursor, I will rather summon it manually: I use lsp-ui-docs-toggle for that and have bound it to "?" -> check lsp ui config for details.
  (lsp-eldoc-render-all nil)

  ;; At the top of the file, show info about the position of the cursor (path, module, symbol, ...).
  (lsp-headerline-breadcrumb-enable t)
  (lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))

  (lsp-semantic-tokens-enable t) ; Richer highlighting (e.g. differentiates function symbol from var symbol).
  :config
  (general-define-key :states '(normal)
                      :keymaps 'lsp-mode-map
                      "," lsp-command-map
  )
)

(use-package lsp-ui
  :after (lsp-mode evil)
  :commands lsp-ui-mode
  :custom
  ;; Show "hover" documentation for a thing under cursor/pointer in a popup.
  (lsp-ui-doc-enable t)
  ;; I don't want it to popup constantly as I move around, instead I want to summon it when I need it.
  ;; That is why below I define "?" as a key for toggling it.
  (lsp-ui-doc-show-with-cursor nil)
  ;; If I hover with a mouse, then do show the docs, that is not too intrusive.
  (lsp-ui-doc-show-with-mouse t)
  ;; Show the docs next to the cursor/point.
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-include-signature t)
  (lsp-ui-doc-max-height 30)

  ;; lsp-ui-sideline shows info that you want (e.g. diagnostics, code actions, ...)  on the right
  ;; side of the window, inline with the code.  We set it to nil here though, because we control
  ;; it from another package, sideline + sideline-lsp.
  (lsp-ui-sideline-enable nil)
  :config
  (general-define-key :states '(normal visual)
                      :keymaps 'lsp-mode-map
                      "?" 'lsp-ui-doc-glance ; TODO: This is sometimes being overshadowed with ? from evil mode, fix that.
                      "F" 'lsp-ui-doc-focus-frame
  ) 
  (setq evil-lookup-func 'lsp-ui-doc-glance)
)

(defun lsp-booster--advice-json-parse (old-fn &rest args)
  "Try to parse bytecode instead of json."
  (or
  (when (equal (following-char) ?#)
    (let ((bytecode (read (current-buffer))))
      (when (byte-code-function-p bytecode)
        (funcall bytecode))))
  (apply old-fn args)))
(advice-add (if (progn (require 'json)
                      (fboundp 'json-parse-buffer))
                'json-parse-buffer
              'json-read)
            :around
            #'lsp-booster--advice-json-parse)

(defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
  "Prepend emacs-lsp-booster command to lsp CMD."
  (let ((orig-result (funcall old-fn cmd test?)))
    (if (and (not test?)                             ;; for check lsp-server-present?
            (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
            lsp-use-plists
            (not (functionp 'json-rpc-connection))  ;; native json-rpc
            (executable-find "emacs-lsp-booster"))
        (progn
          (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
            (setcar orig-result command-from-exec-path))
          (message "Using emacs-lsp-booster for %s!" orig-result)
          (cons "emacs-lsp-booster" orig-result))
      orig-result)))
(advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)

;; Brings lsp-ivy-workspace-symbol that searches for a symbol in project as you type its name.
;; TODO: Add a keybinding, under lsp-keymap-prefix, for this command, I guess under goto? So ", g s"?
(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

;; Shows list of all errors in a nice treemacs fashion.
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)
