vanilla-emacs.d/Emacs.org
** Treesitter
Treesitter is for syntax understanding of the code what LSP is for semantic understanding of the code.
Same like LSP, Treesitter removes the burden from the specific editor to implement all the logic related to dealing with syntax, and instead any editor can just leverage the one central implementation of it: Treesitter + corresponding treesitter grammar for specific language. In return, you get very good syntax highlighting, cleverer editing and movement through code, better indentation, ... -> anything that can be built with konwledge of concrete syntax tree.

Emacs 29 brings its own built-in treesitter package (~treesit~).
The only thing we need to configure is to tell it which grammars to pull in for which language.
Now we have working treesitter for those languages! It is not used anywhere yet though.

Easiest way to start using treesitter is to use one of the built-in major language modes that come with Emacs 29, that are made around using treesitter (they mostly use it for syntax highlighting): typescript-ts-mode, markdown-ts-mode, ... . We can easily check which exist by doing ~apropos~ and then ~-ts-mode$~. There are also third party major modes made with treesitter in mind (e.g. ~haskell-ts-mode~) that we can use, and additionaly, some older packages have added support for treesitter so we can toggle it there.
It't not all about syntax highligthing though, there is for example cool ~combobulate~ package that brings structural editing for multiple languages, based on treesitter.

For more details, this article is a great tutorial on treesitter support in Emacs: https://www.masteringemacs.org/article/how-to-get-started-tree-sitter .

#+begin_src emacs-lisp

  (use-package treesit
    :ensure nil ; Because it is built-in package, this tells elpaca to not try to install it.
    :preface
    (defun my/setup-install-grammars ()
      "Install Tree-sitter grammars if they are absent."
      (interactive)
      (dolist (grammar
               ;; Note the version numbers. These are the versions that with Emacs 29.
               ;; I picked those up from https://github.com/mickeynp/combobulate .
               '((css . ("https://github.com/tree-sitter/tree-sitter-css" "v0.20.0"))
                 (bash "https://github.com/tree-sitter/tree-sitter-bash")
                 (go . ("https://github.com/tree-sitter/tree-sitter-go" "v0.20.0"))
                 (html . ("https://github.com/tree-sitter/tree-sitter-html" "v0.20.1"))
                 (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript" "v0.20.1" "src"))
                 (json . ("https://github.com/tree-sitter/tree-sitter-json" "v0.20.2"))
                 (markdown . ("https://github.com/ikatyang/tree-sitter-markdown" "v0.7.1"))
                 (python . ("https://github.com/tree-sitter/tree-sitter-python" "v0.20.4"))
                 (rust . ("https://github.com/tree-sitter/tree-sitter-rust" "v0.21.2"))
                 (toml . ("https://github.com/tree-sitter/tree-sitter-toml" "v0.5.1"))
                 (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "v0.20.3" "tsx/src"))
                 (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "v0.20.3" "typescript/src"))
                 (yaml . ("https://github.com/ikatyang/tree-sitter-yaml" "v0.5.0"))
                 (haskell . ("https://github.com/tree-sitter/tree-sitter-haskell"))
                 (prisma "https://github.com/victorhqc/tree-sitter-prisma")
  	       (elisp "https://github.com/Wilfred/tree-sitter-elisp")
  	       (c "https://github.com/tree-sitter/tree-sitter-c")
                 (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
                 (cmake . ("https://github.com/uyha/tree-sitter-cmake" "v0.5.0" "src"))
  	     ))
        (add-to-list 'treesit-language-source-alist grammar)
        ;; Only install `grammar' if we don't already have it installed.
        ;; However, if we update a grammar version above then this won't update it since it is already installed,
        ;; I should instead run `treesit-install-language-grammar' manually for it.
        (unless (treesit-language-available-p (car grammar))
          (treesit-install-language-grammar (car grammar))))
    )
    :config
    (customize-set-variable 'treesit-font-lock-level 4) ; Use maximum details (4/4) when doing syntax highlighting.
    (my/setup-install-grammars)
  )

#+end_src

*** Cheatsheet :cheatsheet:
- Cool commands are ~treesit-explore-mode~ and ~treesit-inspect-mode~: they allow inspecting the concrete syntax tree in a buffer!

** Haskell

#+begin_src emacs-lisp
  (defun my/lsp-haskell-local-face-setup ()
    ;; semhl stands for "semantic highlight" -> faces with "semhl" are faces for lsp semantic tokens.
    ;; By default, lsp-face-semhl-operator just inherits lsp-face-semhl-function, which I found to be a shame.
    ;; By setting them to keyword face, operators are nicely visible.
    (face-remap-add-relative 'lsp-face-semhl-operator '(:foregrund unspecified :inherit lsp-face-semhl-keyword))
    ;; I don't want to differentiate class methods from functions by color, that is just confusing.
    (face-remap-add-relative 'lsp-face-semhl-method '(:foreground unspecified :inherit lsp-face-semhl-function))
    ;; haskell-operator-face is used for stuff like `::`, `->` and similar. By default they were the same as
    ;; variables, I didn't like that so I made them same as other operators, which is keyword face.
    (face-remap-add-relative 'haskell-operator-face '(:foreground unspecified :inherit font-lock-keyword-face))
    ;; By default haskell keywords (import, where, ...) already are set to font-lock-keyword-face,
    ;; I just added :weight semi-bold to make them stand out a bit.
    (face-remap-add-relative 'haskell-keyword-face '(:weight semi-bold :inherit font-lock-keyword-face))
  )

  (defun my/haskell-mode-setup ()
    (lsp-deferred)
    (ormolu-format-on-save-mode)
    (face-remap-add-relative 'font-lock-operator-face '(:foreground unspecified :inherit font-lock-keyword-face))
    (add-hook 'lsp-after-open-hook 'my/lsp-haskell-local-face-setup nil t)
  )

  ;; NOTE: Requires ormolu to be installed on the machine.
  (use-package ormolu)

  (use-package haskell-mode
    :hook
    (haskell-mode . my/haskell-mode-setup)
    (haskell-literate-mode . my/haskell-mode-setup)
  )

  ;; ;; TODO: Some current problems:
  ;; ;;  - Doesn't highlight as much stuff as I would like it to (https://codeberg.org/pranshu/haskell-ts-mode/issues/7).
  ;; ;;    - actually it does apply font-lock-operator-face but I guess it is just white -> make that one interesting, e.g. use keyword face.
  ;; ;;    - I used treesit-explore-mode and it is great, I can see exactly how it understand the code, and it knows so much! So it does know a ton about the code, but we are not using it! WHy is that so? Beacause haskell-ts-mode is just not applying font lock faces to all these tokens, it seems so. It really should! Can I customize that myself, or do I need to make a PR on the haskell-ts-mode package?
  ;; ;;  - Is too smart while highlighting signature.
  ;; ;;  - Can't get it to be default mode becuase haskell-mode still gets pulled in with lsp-haskell.
  ;; ;;    I need to either make sure it doesn't get pulled in, or remove it from loading for .hs files.
  ;; ;;  - What is with literate mode?
  ;; (use-package haskell-ts-mode
  ;;   :load-path "~/git/haskell-ts-mode" ; NOTE: This is for using my local fork of the package, for dev purposes. Remove this line to use public version of the package.
  ;;   :mode (("\\.hs\\'" . haskell-ts-mode))
  ;;   :hook
  ;;   (haskell-ts-mode . my/haskell-mode-setup)
  ;;   ;;(haskell-literate-mode . my/haskell-mode-setup) ; What about literate mode?
  ;;   :config
  ;;   (setq haskell-ts-highlight-signature nil)
  ;;   (setq haskell-ts-font-lock-level 4) ; Maximum syntax highlighting.
  ;; )

  ;; Teaches lsp-mode how to find and launch HLS (Haskell Language Server).
  (use-package lsp-haskell
    :after lsp-mode 
    :custom
    ;; This takes syntax highlighting to the maximum of detail. It is a bit slow though!
    (lsp-haskell-plugin-semantic-tokens-global-on t)
  )


#+end_src

*** Cheatsheet :cheatsheet:
- haskell-mode brings interactive mode where you get a ghci session in which you can easily load specific files and run stuff from them. To start it, run `interactive-haskell-mode`. File is added to it by ~haskell-process-load-file~ while in a Haskell file buffer.
- Haskell mode registers its keymap under "C-c", so check that for common commands.


*** TODO Try using haskell-ts-mode instead of haskell-mode
haskell-mode doesn't know how to use treesitter, and haskell-ts-mode, which is a new mode that somebody made that should replace haskell-mode but with ts support, has much less features than haskell-mode and is less mature. But maybe that is ok and worth trying? Do I use any of advanced haskell-mode features anyway? I don't think so.
  - https://codeberg.org/pranshu/haskell-ts-mode

