vanilla-emacs.d/Emacs.org
** TypeScript / Javascript
NOTE: I chose ts-ls as a language server, when asked.

#+begin_src emacs-lisp

  (defun my/add-jsdoc-in-typescript-ts-mode ()
    "Add jsdoc treesitter rules to typescript as a host language."
    ;; I copied this code from js.el (js-ts-mode), with minimal modifications.
    (when (treesit-ready-p 'typescript)
      (when (treesit-ready-p 'jsdoc t)
        (setq-local treesit-range-settings
                    (treesit-range-rules
                      :embed 'jsdoc
                      :host 'typescript
                      :local t
                      `(((comment) @capture (:match ,(rx bos "/**") @capture)))))
        (setq c-ts-common--comment-regexp (rx (or "comment" "line_comment" "block_comment" "description")))

        (defvar my/treesit-font-lock-settings-jsdoc
          (treesit-font-lock-rules
          :language 'jsdoc
          :override t
          :feature 'document
          '((document) @font-lock-doc-face)

          :language 'jsdoc
          :override t
          :feature 'keyword
          '((tag_name) @font-lock-constant-face)

          :language 'jsdoc
          :override t
          :feature 'bracket
          '((["{" "}"]) @font-lock-bracket-face)

          :language 'jsdoc
          :override t
          :feature 'property
          '((type) @font-lock-type-face)

          :language 'jsdoc
          :override t
          :feature 'definition
          '((identifier) @font-lock-variable-face)
          )
        )
        (setq-local treesit-font-lock-settings
                    (append treesit-font-lock-settings my/treesit-font-lock-settings-jsdoc))
      )
    )
  )

  ;; This is a built-in package that brings major mode(s) that use treesitter for highlighting.
  ;; It defines typescript-ts-mode and tsx-ts-mode.
  (use-package typescript-ts-mode
    :ensure nil ; Built-in, so don't install it via package manager.
    :mode (("\\.[mc]?[jt]s\\'" . typescript-ts-mode)
           ("\\.[jt]sx\\'" . tsx-ts-mode)
          )
    :hook (((typescript-ts-mode tsx-ts-mode) . lsp-deferred))
    :hook (((typescript-ts-mode tsx-ts-mode) . #'my/add-jsdoc-in-typescript-ts-mode))
  )

#+end_src

*** TODO Customize LSP semantic token faces to be aligned with treesitter highlighting.

*** LSP ESLint

This will also run eslint language server next to the other language servers if there is an eslint config file in the project.

#+begin_src emacs-lisp

  (use-package lsp-eslint
    :ensure nil ;; Don't install since it comes built-in with lsp-mode.
    :after lsp-mode
  )
  
#+end_src

**** Manual setup :manual_setup:
- =M-x lsp-install-server RET eslint RET=
  
** Web (HTML, CSS, ...)
Emacs comes with built-in =html=, =mhtml=, and =css= mode, so I am just relying on those for now, they seem to work well enough for my purposes.
Also popular is =web-mode=, so I might want to look into that one day, but I haven't had the need so far so decided to keep it light.
** YAML

#+begin_src emacs-lisp

  ;; Built-in YAML major mode with treesitter highlighting.
  (use-package yaml-ts-mode
    :ensure nil ; Built-in, so don't install it via package manager.
    :mode ("\\.ya?ml\\'" . yaml-ts-mode)
    :hook (yaml-ts-mode . lsp-deferred)
  )

#+end_src

** Markdown

#+begin_src emacs-lisp

  (use-package markdown-mode
    :config
    ;; Set headers to have different sizes.
    (dolist (face '((markdown-header-face-1 . 1.5)
                    (markdown-header-face-2 . 1.3)
                    (markdown-header-face-3 . 1.2)
                    (markdown-header-face-4 . 1.1)
                    (markdown-header-face-5 . 1.1)
                    (markdown-header-face-6 . 1.1)))
      (set-face-attribute (car face) nil :height (cdr face))
    )
  )

#+end_src

* AI
** Overview of popular packages
Last updated: <2024-12-23 Mon>

Quick summary:
For now I will go with gpt.el (for general usage), copilot.el (for completion) and copilot-chat.el (for general usage). gpt.el and copilot-chat.el are overlapping in what they can do, so I have to figure out which I like better. gpt.el however can use any model, while copilot-chat has to use copilot, but is free for me.
Out of higher-level models, I think Ellama and aider.el might be worth trying out for me. Elisa is also interesting, although it might be better if I just set up PrivateGPT and use it with gpt.el.
I might also want to try out chatgpt-shell at some point, it is similar to gptel uses different approach.

*** High level
- [[https://github.com/s-kostyaev/ellama][Ellama]]
  Has cmds to ask llm to summarize, translate, complete, code review, use CoT, ... . A lot of very specific commands for specific tasks.
  Seems to me like I can do most of this with gpt.el directly with just a bit more work, so I will skip trying out Ellama for now, and maybe try it once I feel that I want more from gpt.el and Ellama offers it.
- [[https://github.com/tninja/aider.el][aider.el]]
  Makes it easy to use Aider from emacs, for the current project, and send it buffers and similar.
  Has nice transient menu.
  Certainly worth trying if using Aider.
- [[https://github.com/daedsidog/evedel][Evedel]]
  Uses gpt.el as a backend and needs it installed.
  Introduces unique workflow for working with LLM where you add instructions(directives) and references in the text/code in your buffer and that is sent to the LLM in order to modify it.
  Sounds powerful, but for now I don't need that level of control over how LLM refactors piece of my code.
- [[https://github.com/s-kostyaev/elisa][Elisa]]
  Implementation of RAG to be used in your emacs.
  Combines local files/dirs, Emacs info manuals, and web search -> all these are added to "collection(s)".
  And then you can ask questions about it.
  Sounds awesome for working on specific projects with specific knowledge, but is a bit limited in the way that it can do only chatting. Probably it is better for me to sure PrivateGPT then, as a backend for gpt.el.
- [[https://github.com/lanceberge/elysium][elysium]]
  Uses gpt.el as backend and needs it installed.
  Narrow-focused: given the query, it applies changes directly to the selected code. But I believe gpt.el can also do that?
*** Mid-level
- [[https://github.com/karthink/gptel][gptel]]
  Allows for chatting with llm of choice anywhere in Emacs, with a lot of care about DX and being inobtrusive.
  Quite flexible, allows a lot of customization on the fly with nice transient menu.
  Also has commands for stuff like rewriting a piece of code, adding buffers to the context, ... .
  Has support for multi-modal: specifically images.
  Most popular emacs LLM package at the moment.
- [[https://github.com/copilot-emacs/copilot.el][copilot.el]]
  Brings copilot completion to Emacs.
- [[https://github.com/chep/copilot-chat.el][copilot-chat.el]]
  Brings copilot-chat capabilities to Emacs. Similar to gptel in what it can do, but only for copilot as a backend.
- [[https://github.com/xenodium/chatgpt-shell][chatgpt-shell]]
  Similar to gptel, but as a comint shell, which is a kind of specific emacs's mechanism for prompts / convos.
*** Low-level
- [[https://github.com/ahyatt/llm][llm]]

** GPTel
=gptel= is a "mid-level" LLM package for emacs. It doesn't prescribe specific opinionated workflows but instead offers an easy, integrated way to interact with LLM from any emacs buffer.

