vanilla-emacs.d/init.el

(defun my/add-jsdoc-in-typescript-ts-mode ()
  "Add jsdoc treesitter rules to typescript as a host language."
  ;; I copied this code from js.el (js-ts-mode), with minimal modifications.
  (when (treesit-ready-p 'typescript)
    (when (treesit-ready-p 'jsdoc t)
      (setq-local treesit-range-settings
                  (treesit-range-rules
                    :embed 'jsdoc
                    :host 'typescript
                    :local t
                    `(((comment) @capture (:match ,(rx bos "/**") @capture)))))
      (setq c-ts-common--comment-regexp (rx (or "comment" "line_comment" "block_comment" "description")))

      (defvar my/treesit-font-lock-settings-jsdoc
        (treesit-font-lock-rules
        :language 'jsdoc
        :override t
        :feature 'document
        '((document) @font-lock-doc-face)

        :language 'jsdoc
        :override t
        :feature 'keyword
        '((tag_name) @font-lock-constant-face)

        :language 'jsdoc
        :override t
        :feature 'bracket
        '((["{" "}"]) @font-lock-bracket-face)

        :language 'jsdoc
        :override t
        :feature 'property
        '((type) @font-lock-type-face)

        :language 'jsdoc
        :override t
        :feature 'definition
        '((identifier) @font-lock-variable-face)
        )
      )
      (setq-local treesit-font-lock-settings
                  (append treesit-font-lock-settings my/treesit-font-lock-settings-jsdoc))
    )
  )
)

;; This is a built-in package that brings major mode(s) that use treesitter for highlighting.
;; It defines typescript-ts-mode and tsx-ts-mode.
(use-package typescript-ts-mode
  :ensure nil ; Built-in, so don't install it via package manager.
  :mode (("\\.[mc]?[jt]s\\'" . typescript-ts-mode)
         ("\\.[jt]sx\\'" . tsx-ts-mode)
        )
  :hook (((typescript-ts-mode tsx-ts-mode) . lsp-deferred))
  :hook (((typescript-ts-mode tsx-ts-mode) . #'my/add-jsdoc-in-typescript-ts-mode))
)

(use-package lsp-eslint
  :ensure nil ;; Don't install since it comes built-in with lsp-mode.
  :after lsp-mode
)

;; Built-in YAML major mode with treesitter highlighting.
(use-package yaml-ts-mode
  :ensure nil ; Built-in, so don't install it via package manager.
  :mode ("\\.ya?ml\\'" . yaml-ts-mode)
  :hook (yaml-ts-mode . lsp-deferred)
)

(use-package markdown-mode
  :config
  ;; Set headers to have different sizes.
  (dolist (face '((markdown-header-face-1 . 1.5)
                  (markdown-header-face-2 . 1.3)
                  (markdown-header-face-3 . 1.2)
                  (markdown-header-face-4 . 1.1)
                  (markdown-header-face-5 . 1.1)
                  (markdown-header-face-6 . 1.1)))
    (set-face-attribute (car face) nil :height (cdr face))
  )
)
