vanilla-emacs.d/Emacs.org
*** TODO Look into gptel-directives (enrich "rewrite")
I can write my own gptel-directives, therefore controlling how e.g. rewrite is done.
They are dynamic -> functions -> so I can enrich the request any way I want. E.g. I could fetch the location of current region for the "rewrite" and pass that, if I implement my own "rewrite" directive.
Here is reddit answer https://www.reddit.com/r/emacs/s/5FYxlNZVCZ which contains this example: https://paste.karthinks.com/67b98a11-gptel-rewrite-with-context.html .
He basically takes default value of "rewrite" directive (its a fuction) and creates his own based on it.
- I could also look into collecting the errors/warnings in the buffer and sending that to the LLM. That shouldn't be hard. Maybe as a part of rewrite, but also as a part of just chatting with the LLM? Meaning even as "ask" or just sending to chat hm. I can just collect errors as reported by flymake/check probably? That would be cool.
- When adding errors/warnings, I can add them with org drawers so they are collapsed but there.
*** TODO Look into gptel-context-wrap-function
*** TODO Look into defining custom gptel commands
- https://github.com/karthink/gptel/wiki/Defining-custom-gptel-commands
- Useful if I want to write my own rewrite and ask commands with gptel-request?
*** DONE Write a function that summarizes the current chat.
I could maybe combine this with that "org branching gptel" feature, so that the whole history of the convo is still kept, but it also gets branched with context or something. Ok I probably don't need that though hah.
Btw I should look online for "summarizing" prompt, I am sure people have figured out some good prompts.
*** TODO Set up tool usage via MCP (check gptel's docs)
*** TODO Add https://github.com/karthink/gptel-quick ?
*** TODO Look up into using gptel for completion at point, there is a package for it
- https://www.reddit.com/r/emacs/s/eRJhgE0NxT
- It is cool because it already has the context I was building up.
*** TODO Look into gptel-prompts
https://www.reddit.com/r/emacs/comments/1lcc1hy/fun_with_gptel_gptelprompts/
** Copilot

*** copilot.el

I have it off by default because I find it intrusive. I however defined a keybinding for toggling copilot-mode easily.

#+begin_src emacs-lisp

  (use-package copilot
    :ensure (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
    :config
    (define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
    (my/leader-keys
      "i TAB" '("toggle copilot" . copilot-mode)
    )
  )

#+end_src

**** Manual setup                                           :manual_setup:
- install the copilot server: ~M-x copilot-install-server~
- login to copilot with ~M-x copilot-login~


*** copilot-chat.el

Has big overlap with gptel but I have both for now, to see which I like better, or maybe I can mix and match.

Besides basic chat in which you can add/remove buffers into context, it also has some convenience commands for reviewing/fixing/optimizing code, writing tests and similar.

Most straightforward way to use it is to run ~copilot-chat-transient~ since that shows all the possible things one can do. All the reviewing/fixing/testing code commands are under =code= option.

#+begin_src emacs-lisp

  (use-package copilot-chat
    :config
    (my/leader-keys
      "i I" '("copilot chat" . copilot-chat-transient))
  )

#+end_src

**** TODO When in buffer list, its special keybindings (RET, g, ...) don't work, I believe because of evil, fix that.

** TODOs
*** TODO Learn/configure gptel
- Here is a bit more on effectively using gptel: https://www.reddit.com/r/emacs/s/O7Kh4Z9uNV .
- About tool use + translation RAG in emacs using gptel and a super crappy LLM: https://www.reddit.com/r/emacs/s/IbQJijOHHZ .
*** TODO Lean how to use Aider
- There is Aidermacs, try it.
- A bit about using Aider in Emacs, and other stuff, to get closer to Cursor experience: https://www.reddit.com/r/emacs/comments/1ikdb5c/how_is_cursor_ai_better_than_emacs/?share_id=-3XEqsEXmq65_vdCzFM6H&utm_content=1&utm_medium=android_app&utm_name=androidcss&utm_source=share&utm_term=10
- There is aider.el, I might want to look into that one, or I can just use Aider directly form the terminal. https://github.com/tninja/aider.el
- Aidermacs: another package for using aider in emacs, allegedly it is cool: https://www.reddit.com/r/emacs/s/ej9qMsblZq .
*** TODO Try other stuff (Elysium? Evedel? Others?)
* Formatting
** Whitespaces

=whitespace-mode= is a built-in emacs package whose main purpose is to *visualize all whitespaces*.

#+begin_src emacs-lisp

  (use-package whitespace
    :ensure nil ; Don't install as it is built-in with emacs.
    :config
    ; Don't highlight too-long lines, because it is too noisy and we use another package for that anyway.
    (setq whitespace-style (delq 'lines whitespace-style))

    ; Default faces are not visible enough (grey), so I set all the faces to something more visible.
    (dolist (face '(whitespace-big-indent
                    whitespace-empty
                    whitespace-hspace
                    whitespace-indentation
                    whitespace-line
                    whitespace-missing-newline-at-eof
                    whitespace-newline
                    whitespace-space
                    whitespace-space-after-tab
                    whitespace-space-before-tab
                    whitespace-tab
                    whitespace-trailing))
      (set-face-attribute face nil :foreground "dark red")
    )

    (my/leader-keys
      "t w" '("whitespaces" . whitespace-mode)
    )
  )

#+end_src

=ethan-wspace-mode= takes care of *redundant/trailing* whitespaces (removal, highlighting).
It operates on the principle of clean/dirty files:
 - If file is clean (has no redundant whitespaces) then it removes any new redundant whitespace on save.
 - If file is dirty then it only highlights any redundant whitespace.
Therefore, once file becomes clean, you can't add any redundant whitespaces.
If that is an issue and you do want to make add a redundant whitespace (e.g. in markdown file), then you
can turn off =ethan-mode= for a bit to add them. That will make the file dirty and stop removing whitespaces, only highlight them.

#+begin_src emacs-lisp

  (use-package ethan-wspace
    :init
    (setq mode-require-final-newline nil)
    :config
    (global-ethan-wspace-mode 1)
    ;; There is ethan-wspace-face if I want to configure what it looks like.
  )

#+end_src

*** Cheatsheet :cheatsheet:
- ~M-x ethan-wspace-clean-all~ to remove all redundant whitespace and therefore turn the file into a clean one.


** Long lines

=column-enforce-mode= highlights lines that are too long (the part that goes over the max column).

Common advice these days is to use =whitespace-mode= for this, as it can be configured that it shows only highlights too long parts of lines when mode is on.
However, I don't like that approach as it means I can't easily use whitespace for its main purpose, which is toggling it on and off to inspect all the whitespaces.
Instead, it would have to be on all the time and I would need to configure what it highlights when I want to see more, which feels hacky.
That is why I instead I use this dedicated mode that does just this: highlights too longs parts of lines.

#+begin_src emacs-lisp

  (use-package column-enforce-mode
    :hook (prog-mode . column-enforce-mode)
    :config
    (setq column-enforce-column fill-column)
    (set-face-attribute 'column-enforce-face nil
                        :inherit nil
                        :background "black"
                        :underline '(:style wave :color "purple")
    )
  )

#+end_src

* Misc

#+begin_src emacs-lisp

  (use-package recentf
    :ensure nil  ;; built-in
    :custom
    (recentf-max-saved-items 50)
    :config
    (recentf-mode 1)
  )

#+end_src

#+begin_src emacs-lisp

  ;; Primarily supposed to be used with visual-line-mode (which is emacs builtin that soft wraps the line at window end).
  ;; visual-fill-column, when used with visual-line-mode, modifies the wrapping to happen at the fixed (by default fill-column) width,
  ;; instead of at the window end.
  ;; It can also center the text.
  ;; Useful for making the buffer look "document" like.
  (use-package visual-fill-column)

#+end_src

#+begin_src emacs-lisp

  ;; This makes copy/paste properly work when emacs is running via the terminal.
  (use-package xclip
    :config
    (xclip-mode 1)
  )

#+end_src

#+begin_src emacs-lisp

  ;; Allows fast jumping inside the buffer (to word, to line, ...).
  (use-package avy)

#+end_src

#+begin_src emacs-lisp

  ;; Allows jumping to any window by typing just a single letter.
  (use-package ace-window)

#+end_src

#+begin_src emacs-lisp

  ;; This package gives me commands to jump to a window with specific number (ace-window doesn't do that).
  (use-package winum
    :config
    (winum-mode)
  )

#+end_src

#+begin_src emacs-lisp

  ;; Remembers last used commands and puts them on top of M-x's list of commands.
  ;; Integrates seamlessly with Ivy/Counsel, Ido and some other.
  (use-package amx)

#+end_src

#+begin_src emacs-lisp

  ;; Highlight TODO and similar keywords in comments and strings.
  (use-package hl-todo
    :config
    (global-hl-todo-mode)
  )

#+end_src

#+begin_src emacs-lisp

  ;; Utility package that provides nice icons to be used in emacs, by other packages.
  ;; NOTE: The first time you load your config on a new machine, you'll have to
  ;; run the following command interactively:
  ;; M-x all-the-icons-install-fonts
  (use-package all-the-icons)

#+end_src

#+begin_src emacs-lisp

  ;; Enhances built-in Emacs help with more information: A "better" Emacs *Help* buffer.
  (use-package helpful
    :defer t
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    (([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key)
    ("C-h h" . helpful-at-point)
    )
  )

#+end_src

#+begin_src emacs-lisp

  ;; Colorizes color names in buffers.
  ;; Works better than clasical rainbow-mode, which would mess up Help buffer for me.
  (use-package colorful-mode
    :config
    (add-to-list 'global-colorful-modes 'help-mode)
    (global-colorful-mode)
  )

#+end_src

#+begin_src emacs-lisp

  ;; It colors each pair of parenthesses into their own color.
  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode)
  )

#+end_src

#+begin_src emacs-lisp

  ;; Brings functions for converting buffer text and decorations to html.
  (use-package htmlize)

#+end_src

#+begin_src emacs-lisp

  ;; This introduces redundancy, because we exactly replicate the content of dir local vars that we want to allow automatically,
  ;; but on the other hand it is the recommended/official way to be sure that we are ok with execution of that code, and not have
  ;; emacs keep asking us if we want to execute them.
  (setq safe-local-variable-values
    '((eval with-eval-after-load 'lsp-mode
  	  (add-to-list 'lsp-file-watch-ignored-directories "/e2e-test/test-outputs\\'")))
  )

#+end_src

