vanilla-emacs.d/init.el
  :ensure (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  :config
  (define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
  (my/leader-keys
    "i TAB" '("toggle copilot" . copilot-mode)
  )
)

(use-package copilot-chat
  :config
  (my/leader-keys
    "i I" '("copilot chat" . copilot-chat-transient))
)

(use-package whitespace
  :ensure nil ; Don't install as it is built-in with emacs.
  :config
  ; Don't highlight too-long lines, because it is too noisy and we use another package for that anyway.
  (setq whitespace-style (delq 'lines whitespace-style))

  ; Default faces are not visible enough (grey), so I set all the faces to something more visible.
  (dolist (face '(whitespace-big-indent
                  whitespace-empty
                  whitespace-hspace
                  whitespace-indentation
                  whitespace-line
                  whitespace-missing-newline-at-eof
                  whitespace-newline
                  whitespace-space
                  whitespace-space-after-tab
                  whitespace-space-before-tab
                  whitespace-tab
                  whitespace-trailing))
    (set-face-attribute face nil :foreground "dark red")
  )

  (my/leader-keys
    "t w" '("whitespaces" . whitespace-mode)
  )
)

(use-package ethan-wspace
  :init
  (setq mode-require-final-newline nil)
  :config
  (global-ethan-wspace-mode 1)
  ;; There is ethan-wspace-face if I want to configure what it looks like.
)

(use-package column-enforce-mode
  :hook (prog-mode . column-enforce-mode)
  :config
  (setq column-enforce-column fill-column)
  (set-face-attribute 'column-enforce-face nil
                      :inherit nil
                      :background "black"
                      :underline '(:style wave :color "purple")
  )
)

(use-package recentf
  :ensure nil  ;; built-in
  :custom
  (recentf-max-saved-items 50)
  :config
  (recentf-mode 1)
)

;; Primarily supposed to be used with visual-line-mode (which is emacs builtin that soft wraps the line at window end).
;; visual-fill-column, when used with visual-line-mode, modifies the wrapping to happen at the fixed (by default fill-column) width,
;; instead of at the window end.
;; It can also center the text.
;; Useful for making the buffer look "document" like.
(use-package visual-fill-column)

;; This makes copy/paste properly work when emacs is running via the terminal.
(use-package xclip
  :config
  (xclip-mode 1)
)

;; Allows fast jumping inside the buffer (to word, to line, ...).
(use-package avy)

;; Allows jumping to any window by typing just a single letter.
(use-package ace-window)

;; This package gives me commands to jump to a window with specific number (ace-window doesn't do that).
(use-package winum
  :config
  (winum-mode)
)

;; Remembers last used commands and puts them on top of M-x's list of commands.
;; Integrates seamlessly with Ivy/Counsel, Ido and some other.
(use-package amx)

;; Highlight TODO and similar keywords in comments and strings.
(use-package hl-todo
  :config
  (global-hl-todo-mode)
)

;; Utility package that provides nice icons to be used in emacs, by other packages.
;; NOTE: The first time you load your config on a new machine, you'll have to
;; run the following command interactively:
;; M-x all-the-icons-install-fonts
(use-package all-the-icons)

;; Enhances built-in Emacs help with more information: A "better" Emacs *Help* buffer.
(use-package helpful
  :defer t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  (([remap describe-command] . helpful-command)
  ([remap describe-key] . helpful-key)
  ("C-h h" . helpful-at-point)
  )
)

;; Colorizes color names in buffers.
;; Works better than clasical rainbow-mode, which would mess up Help buffer for me.
(use-package colorful-mode
  :config
  (add-to-list 'global-colorful-modes 'help-mode)
  (global-colorful-mode)
)

;; It colors each pair of parenthesses into their own color.
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode)
)

;; Brings functions for converting buffer text and decorations to html.
(use-package htmlize)

;; This introduces redundancy, because we exactly replicate the content of dir local vars that we want to allow automatically,
;; but on the other hand it is the recommended/official way to be sure that we are ok with execution of that code, and not have
;; emacs keep asking us if we want to execute them.
(setq safe-local-variable-values
  '((eval with-eval-after-load 'lsp-mode
	  (add-to-list 'lsp-file-watch-ignored-directories "/e2e-test/test-outputs\\'")))
)
